{
  "backend/main.mo": "Defines core data types and maps for salons, bookings, images, and user profiles, includes access control and storage mixins, and seeds default Swiss salon data if empty.",
  "feature_evidence.json": "Lists feature evidence entries describing required frontend overwrites, mechanical fixes, related components, and test IDs for build compliance.",
  "frontend-file-summaries.txt": "Contains human‑written summaries of all frontend files detailing their purpose, UI behavior, and functional roles.",
  "frontend/index.css": "Sets global Tailwind CSS variables for light/dark themes and applies base background/foreground styles.",
  "frontend/index.html": "Basic HTML template mounting the React app at #root and loading main.tsx.",
  "frontend/src/App.tsx": "Minimal wrapper that renders and exports AppV1 as the root component.",
  "frontend/src/AppV1.jsx": "Large React component defining the full V45 premium UI with salon presets, utilities, and custom card components for the main app experience.",
  "frontend/src/components/AuthHeader.tsx": "Empty file placeholder for the AuthHeader component.",
  "frontend/src/components/CreateSalonForm.tsx": "Empty file placeholder for the CreateSalonForm component.",
  "frontend/src/components/MemberCard.tsx": "Empty file placeholder for the MemberCard component.",
  "frontend/src/components/MonopolyModeSwitch.tsx": "Empty file placeholder for the MonopolyModeSwitch component.",
  "frontend/src/components/MotionButton.tsx": "Empty file placeholder for the MotionButton component.",
  "frontend/src/components/PremiumBadge.tsx": "Empty file placeholder for the PremiumBadge component.",
  "frontend/src/components/Pressable.tsx": "Empty file placeholder for the Pressable component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file placeholder for the ProfileSetupModal component.",
  "frontend/src/components/ProSalonWizard.tsx": "Empty file placeholder for the ProSalonWizard component.",
  "frontend/src/components/ProStudioCreator.tsx": "Empty file placeholder for the ProStudioCreator component.",
  "frontend/src/components/RevenueChart.tsx": "Empty file placeholder for the RevenueChart component.",
  "frontend/src/components/SalonListSection.tsx": "Empty file placeholder for the SalonListSection component.",
  "frontend/src/components/VipDashboard.tsx": "Empty file placeholder for the VipDashboard component.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor, refreshing it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, identity restoration, and exposes authentication state to the app.",
  "frontend/src/hooks/useQueries.ts": "Empty file placeholder for backend React Query hooks.",
  "frontend/src/hooks/useSalonImage.ts": "Empty file placeholder for salon image handling logic.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for light/dark themes, scrollbar utilities, safe‑area padding, and multiple animation keyframes/classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers and loading global styles.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/LoginPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/ProDashboardPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/SalonDetailsPage.tsx": "Empty placeholder page component.",
  "frontend/src/utils/auraGenerator.ts": "Generates marketing text for salons using category, type, tags, and city with predefined aura snippets.",
  "frontend/src/utils/currency.ts": "Empty utility file.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors from CSS variables, container settings, animations, and plugins.",
  "project_state.json": "Tracks project version, architectural notes, reset directives, and known issues for the system."
}