{
  "backend/main.mo": "Main canister logic defining salons, bookings, user profiles, images, authorization mixins, and initial salon seeding.",
  "backend/migration.mo": "Migration module transferring old stable state to new format while resetting monopolyMode to false.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base and theme variables defining light and dark mode color tokens and global styles.",
  "frontend/index.html": "Root HTML file bootstrapping the frontend and loading main.tsx.",
  "frontend/src/App.tsx": "Root React app handling authentication, profile loading, and routing between client and pro dashboards.",
  "frontend/src/components/AuthHeader.tsx": "Header component showing location or pro badge, notifications, and logout handling.",
  "frontend/src/components/CreateSalonForm.tsx": "Empty placeholder file intended for a salon creation form.",
  "frontend/src/components/MemberCard.tsx": "Loyalty card UI showing tier, XP, progress to next tier, and reward details.",
  "frontend/src/components/MonopolyModeSwitch.tsx": "Toggle switch component controlling a monopolyMode state with animated styles.",
  "frontend/src/components/MotionButton.tsx": "Button wrapper adding a press-scale motion effect using forwardRef.",
  "frontend/src/components/PremiumBadge.tsx": "Small badge component displaying a Premium label with an icon.",
  "frontend/src/components/Pressable.tsx": "Pressable wrapper that can render as button or div with an active scale effect.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for initial user profile setup with name and role selection.",
  "frontend/src/components/ProSalonWizard.tsx": "Multi-step salon creation wizard handling details, services, images, and submission logic.",
  "frontend/src/components/RevenueChart.tsx": "Static weekly revenue area chart rendered with Recharts.",
  "frontend/src/components/SalonListSection.tsx": "Salon list with category filtering, featured item display, and image loading logic.",
  "frontend/src/components/VipDashboard.tsx": "VIP dashboard showing XP, tier progress, and rewards with loading and error states.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching a backend actor tied to identity, with automatic query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, creating and managing AuthClient state, login flow, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, salons, categories, images, and bookings via the backend actor.",
  "frontend/src/hooks/useSalonImage.ts": "Loads a salon image using a query hook and converts it to a Blob URL for display, with cleanup handling.",
  "frontend/src/index.css": "Tailwind base setup with custom CSS variables, dark mode values, and scrollbar hiding helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Implements the client dashboard with tab navigation, salon listings, profile view, and salon detail transitions.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen and triggers Internet Identity authentication with loading and error states.",
  "frontend/src/pages/ProDashboardPage.tsx": "Implements the pro dashboard with revenue stats, team list, salon creation wizard, and tabbed navigation.",
  "frontend/src/pages/SalonDetailsPage.tsx": "Page React affichant les détails d’un salon, son image, services, créneaux disponibles et permet de réserver via useBookSalon.",
  "frontend/src/utils/currency.ts": "Fonctions utilitaires pour formater des montants en francs suisses au format normal ou compact.",
  "frontend/src/utils/urlParams.ts": "Utilitaires pour lire, stocker, persister et nettoyer des paramètres d’URL ou de sessionStorage, compatibles routing hash et query.",
  "frontend/tailwind.config.js": "Configuration Tailwind étendue avec couleurs OKLCH, animations, plugins typographie, container queries et animate.",
  "project_state.json": "Fichier d’état projet décrivant objectifs, architecture, problèmes connus et fonctionnalités existantes pour la refonte frontend luxe V3."
}