{
  "backend/main.mo": "Defines salon, booking, user, and image types with storage maps, authorization mixins, and a seeding function for default Swiss salons.",
  "feature_evidence.json": "Lists feature evidence entries describing required frontend AppV1.jsx replacement and associated validation tasks.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files covering pages, components, hooks, and styles.",
  "frontend/index.css": "Tailwind base layers defining OKLCH color variables for light/dark themes and global background/text styles.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Thin wrapper that renders and exports AppV1 as the application root.",
  "frontend/src/AppV1.jsx": "Large self‑contained UI implementing the V7000 Nexus Infinity landing, client explorer, pro app stub, mock data, and localStorage state manager.",
  "frontend/src/components/AuthHeader.tsx": "Empty placeholder for an authentication header component.",
  "frontend/src/components/CreateSalonForm.tsx": "Empty placeholder for a salon creation form component.",
  "frontend/src/components/MemberCard.tsx": "Empty placeholder for a loyalty member card component.",
  "frontend/src/components/MonopolyModeSwitch.tsx": "Empty placeholder for a monopoly mode toggle component.",
  "frontend/src/components/MotionButton.tsx": "Empty placeholder for a motion‑enhanced button component.",
  "frontend/src/components/PremiumBadge.tsx": "Empty placeholder for a reusable premium badge component.",
  "frontend/src/components/Pressable.tsx": "Empty placeholder for a tactile pressable wrapper component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder for a profile setup modal.",
  "frontend/src/components/ProSalonWizard.tsx": "Empty placeholder for a multi‑step pro salon creation wizard.",
  "frontend/src/components/ProStudioCreator.tsx": "Empty placeholder for a pro studio creation UI component.",
  "frontend/src/components/RevenueChart.tsx": "Empty placeholder for a revenue chart component.",
  "frontend/src/components/SalonListSection.tsx": "Empty placeholder for a salon list rendering component.",
  "frontend/src/components/VipDashboard.tsx": "Empty placeholder for a VIP dashboard component.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes a backend actor tied to Internet Identity and auto‑invalidates dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login state using AuthClient, including identity loading, login, and error handling.",
  "frontend/src/hooks/useQueries.ts": "Empty file.",
  "frontend/src/hooks/useSalonImage.ts": "Empty file.",
  "frontend/src/index.css": "Defines Tailwind base styles, CSS variables for light/dark themes, custom utilities, and keyframe animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping App in React Query and InternetIdentityProvider.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Empty file.",
  "frontend/src/pages/LoginPage.tsx": "Empty file.",
  "frontend/src/pages/ProDashboardPage.tsx": "Empty file.",
  "frontend/src/pages/SalonDetailsPage.tsx": "Empty file.",
  "frontend/src/utils/auraGenerator.ts": "Generates marketing-style description strings for salons based on category, type, tags, and city.",
  "frontend/src/utils/currency.ts": "Empty file.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session storage values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, radius, animations, and enabling plugins.",
  "project_state.json": "Describes overall project state, including version history, architectural notes, resets, and known issues."
}