{
  "backend/main.mo": "Defines core data types and storage for salons, bookings, images, and user profiles, with seeding logic and mixins for authorization and blob storage.",
  "feature_evidence.json": "Lists feature evidence entries linking V26 UI requirements to specific files, components, and test IDs with high-confidence metadata.",
  "frontend-file-summaries.txt": "Provides short summaries for multiple frontend files describing their purpose, UI behavior, and localization details.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH-derived theme variables for light and dark modes with global background and text rules.",
  "frontend/index.html": "Basic HTML entry file mounting the React app root and loading main.tsx.",
  "frontend/src/App.tsx": "Minimal wrapper that renders the AppV1 component.",
  "frontend/src/AppV1.jsx": "Implements the full V26 QUANTUM REALITY UI including Singularity Loader, hyper‑reality feed, salon cards, interactions, and visual effects.",
  "frontend/src/components/AuthHeader.tsx": "Empty placeholder file for the AuthHeader component.",
  "frontend/src/components/CreateSalonForm.tsx": "Empty placeholder file for the CreateSalonForm component.",
  "frontend/src/components/MemberCard.tsx": "Empty placeholder file for the MemberCard component.",
  "frontend/src/components/MonopolyModeSwitch.tsx": "Empty placeholder file for the MonopolyModeSwitch component.",
  "frontend/src/components/MotionButton.tsx": "Empty placeholder file for the MotionButton component.",
  "frontend/src/components/PremiumBadge.tsx": "Empty placeholder file for the PremiumBadge component.",
  "frontend/src/components/Pressable.tsx": "Empty placeholder file for the Pressable component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file for the ProfileSetupModal component.",
  "frontend/src/components/ProSalonWizard.tsx": "Empty placeholder file for the ProSalonWizard component.",
  "frontend/src/components/ProStudioCreator.tsx": "Empty placeholder file for the ProStudioCreator component.",
  "frontend/src/components/RevenueChart.tsx": "Empty placeholder file for the RevenueChart component.",
  "frontend/src/components/SalonListSection.tsx": "Empty placeholder file for the SalonListSection component.",
  "frontend/src/components/VipDashboard.tsx": "Empty placeholder file for the VipDashboard component.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity, reinitializing access control and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Empty file placeholder for query-related React hooks.",
  "frontend/src/hooks/useSalonImage.ts": "Empty file placeholder for a hook related to salon image handling.",
  "frontend/src/index.css": "Defines Tailwind base layers, CSS variables, dark mode values, scrollbar hiding, and multiple animation keyframes and utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers and loading global styles.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Empty page component placeholder for the client dashboard.",
  "frontend/src/pages/LoginPage.tsx": "Empty page component placeholder for the login screen.",
  "frontend/src/pages/ProDashboardPage.tsx": "Empty page component placeholder for the professional dashboard.",
  "frontend/src/pages/SalonDetailsPage.tsx": "Empty page component placeholder for salon detail view.",
  "frontend/src/utils/auraGenerator.ts": "Generates marketing-oriented aura text based on salon data using category, type, tags, and city modifiers.",
  "frontend/src/utils/currency.ts": "Empty utility file intended for currency helpers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, typography, and container queries, referencing CSS variable-based theming.",
  "project_state.json": "Describes project version, UX direction, architecture resets, frontend plans, and known issues for the evolving app."
}