{
  "backend/main.mo": "Defines core types for salons, bookings, users, and images, initializes authorization and storage mixins, and includes logic for seeding default Swiss salons.",
  "feature_evidence.json": "Lists feature evidence entries describing required frontend behaviors, file targets, and associated components for validation.",
  "frontend-file-summaries.txt": "Provides short textual summaries of numerous frontend files for documentation and build reference.",
  "frontend/index.css": "Sets global Tailwind layers and CSS variables for light/dark themes with color tokens and base styling.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Simple wrapper that renders and exports the AppV1 component.",
  "frontend/src/AppV1.jsx": "Large React file implementing categories, salon data, and the Mirror Protocol flow with recording, review, and success steps.",
  "frontend/src/components/AuthHeader.tsx": "Empty placeholder file for the AuthHeader component.",
  "frontend/src/components/CreateSalonForm.tsx": "Empty placeholder file for the CreateSalonForm component.",
  "frontend/src/components/MemberCard.tsx": "Empty placeholder file for the MemberCard component.",
  "frontend/src/components/MonopolyModeSwitch.tsx": "Empty placeholder file for the MonopolyModeSwitch component.",
  "frontend/src/components/MotionButton.tsx": "Empty placeholder file for the MotionButton component.",
  "frontend/src/components/PremiumBadge.tsx": "Empty placeholder file for the PremiumBadge component.",
  "frontend/src/components/Pressable.tsx": "Empty placeholder file for the Pressable component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file for the ProfileSetupModal component.",
  "frontend/src/components/ProSalonWizard.tsx": "Empty placeholder file for the ProSalonWizard component.",
  "frontend/src/components/ProStudioCreator.tsx": "Empty placeholder file for the ProStudioCreator component.",
  "frontend/src/components/RevenueChart.tsx": "Empty placeholder file for the RevenueChart component.",
  "frontend/src/components/SalonListSection.tsx": "Empty placeholder file for the SalonListSection component.",
  "frontend/src/components/VipDashboard.tsx": "Empty placeholder file for the VipDashboard component.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login flow, stored identities, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Empty file.",
  "frontend/src/hooks/useSalonImage.ts": "Empty file.",
  "frontend/src/index.css": "Defines Tailwind base layers, light/dark theme color variables, and custom animation keyframes and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, rendering the root App component.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Empty file.",
  "frontend/src/pages/LoginPage.tsx": "Empty file.",
  "frontend/src/pages/ProDashboardPage.tsx": "Empty file.",
  "frontend/src/pages/SalonDetailsPage.tsx": "Empty file.",
  "frontend/src/utils/auraGenerator.ts": "Generates styled marketing text for a salon based on category, tags, type, and city.",
  "frontend/src/utils/currency.ts": "Empty file.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, container settings, and enabling plugins.",
  "project_state.json": "Describes the project’s versioned state and architecture notes, including a full frontend/backend reset and new V65 app specifications."
}