{
  "backend/main.mo": "Defines salon, booking, user profile types, initializes maps and mixins, and seeds default Swiss salons if none exist.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of numerous frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base theme defining light/dark OKLCH variables and global resets.",
  "frontend/index.html": "HTML entrypoint mounting the root div and loading main.tsx.",
  "frontend/src/App.tsx": "Wraps and returns the AppV1 component as the main app export.",
  "frontend/src/AppV1.jsx": "Large React component implementing V1 UI with salon cards, search, filters, and booking interactions.",
  "frontend/src/components/AuthHeader.tsx": "Empty placeholder file for the AuthHeader component.",
  "frontend/src/components/CreateSalonForm.tsx": "Empty placeholder for a salon creation form component.",
  "frontend/src/components/MemberCard.tsx": "Empty placeholder for a loyalty member card component.",
  "frontend/src/components/MonopolyModeSwitch.tsx": "Empty placeholder for a monopoly mode toggle component.",
  "frontend/src/components/MotionButton.tsx": "Empty placeholder for a MotionButton wrapper component.",
  "frontend/src/components/PremiumBadge.tsx": "Empty placeholder for a premium badge component.",
  "frontend/src/components/Pressable.tsx": "Empty placeholder for a pressable interaction wrapper.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder for a profile setup modal.",
  "frontend/src/components/ProSalonWizard.tsx": "Empty placeholder for a multi-step salon creation wizard.",
  "frontend/src/components/ProStudioCreator.tsx": "Empty placeholder for a pro studio creation component.",
  "frontend/src/components/RevenueChart.tsx": "Empty placeholder for a revenue chart component.",
  "frontend/src/components/SalonListSection.tsx": "Empty placeholder for a salon list display section.",
  "frontend/src/components/VipDashboard.tsx": "Empty placeholder for a VIP dashboard component.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity provider and hook with login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for React Query hooks.",
  "frontend/src/hooks/useSalonImage.ts": "Empty placeholder for hooks handling salon image logic.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark mode, scrollbar utilities, safe-area padding, keyframe animations, and animation utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Empty page placeholder for the client dashboard.",
  "frontend/src/pages/LoginPage.tsx": "Empty page placeholder for the login screen.",
  "frontend/src/pages/ProDashboardPage.tsx": "Empty page placeholder for the professional dashboard.",
  "frontend/src/pages/SalonDetailsPage.tsx": "Empty page placeholder for salon details view.",
  "frontend/src/utils/auraGenerator.ts": "Generates marketing text for salons based on category, type, tags, and location using predefined phrases.",
  "frontend/src/utils/currency.ts": "Empty utility file for currency-related helpers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters with sessionStorage fallback and hash support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, plugins, and content paths using CSS variables.",
  "project_state.json": "Tracks project version, architectural notes, and known issues for ongoing development resets and UX changes."
}