{
  "backend/main.mo": "Defines salon, booking, and user profile types with authorization, in-memory maps, and a seeding routine for default salons.",
  "backend/migration.mo": "Migration module converting old actor data to the new format by adding missing fields like dates, premium fields, services, and loyalty info.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components with confidence and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of each major frontend file and component.",
  "frontend/index.css": "Tailwind base and theme variables defining light and dark mode colors and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level component handling authentication, profile loading, and routing to client or pro dashboards.",
  "frontend/src/components/AuthHeader.tsx": "Header with branding, user-type badge, notifications icon, and logout logic.",
  "frontend/src/components/CreateSalonForm.tsx": "Empty placeholder file for salon creation form logic.",
  "frontend/src/components/MemberCard.tsx": "Component displaying loyalty tier, XP, and progress calculations with tier-specific styling.",
  "frontend/src/components/MonopolyModeSwitch.tsx": "Toggle component that switches UI styling between normal and monopoly mode with an animated switch.",
  "frontend/src/components/PremiumBadge.tsx": "Renders a small amber-colored Premium badge with a crown icon.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that prompts the user to set name and role, then saves their profile using a mutation.",
  "frontend/src/components/ProSalonWizard.tsx": "Multi-step form for creating a salon, collecting details, services, premium status, and submitting via createSalon.",
  "frontend/src/components/RevenueChart.tsx": "Displays a weekly revenue area chart using Recharts with gradient styling.",
  "frontend/src/components/SalonListSection.tsx": "Fetches and displays salons with categories, a featured premium salon, and a recommended list.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, salons, and booking, connecting them to the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, dark mode overrides, and scrollbar-hiding utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, then renders App.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Implements the client dashboard with tab navigation, salon list, bookings placeholder, and user profile display.",
  "frontend/src/pages/LoginPage.tsx": "Renders a styled login screen integrating Internet Identity authentication with loading and error states.",
  "frontend/src/pages/ProDashboardPage.tsx": "Implements the professional dashboard with revenue widgets, team list, salon creation wizard, and tabbed views.",
  "frontend/src/pages/SalonDetailsPage.tsx": "Shows detailed salon info with service selection, date/slot picking, premium display, and booking flow.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom OKLCH color tokens, extended theme utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state describing the full-stack MVP scope, IC/Motoko backend architecture, frontend behavior requirements, known issues, and the list of implemented features with versioning."
}