{
  "backend/main.mo": "Defines data models for salons, bookings, users, and images, sets up access control and storage mixins, and seeds demo Swiss salons if none exist.",
  "feature_evidence.json": "Lists feature evidence items linking features to affected files, components, and test IDs for build verification.",
  "frontend-file-summaries.txt": "Contains human‑written summaries of various frontend files describing their purpose and behavior.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color variables, light/dark themes, and base styling rules.",
  "frontend/index.html": "Main HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Simple wrapper that renders and exports AppV1 as the root application component.",
  "frontend/src/AppV1.jsx": "Full in-file demo UI with categories, salons, presets, and custom components implementing intro feed, salon cards, details, and pro studio features without backend calls.",
  "frontend/src/components/AuthHeader.tsx": "Empty placeholder file for an authentication header component.",
  "frontend/src/components/CreateSalonForm.tsx": "Empty placeholder for a salon creation form component.",
  "frontend/src/components/MemberCard.tsx": "Empty placeholder for a loyalty member card component.",
  "frontend/src/components/MonopolyModeSwitch.tsx": "Empty placeholder for a toggle controlling monopoly mode.",
  "frontend/src/components/MotionButton.tsx": "Empty placeholder for a motion-enabled button component.",
  "frontend/src/components/PremiumBadge.tsx": "Empty placeholder for a premium salon badge component.",
  "frontend/src/components/Pressable.tsx": "Empty placeholder for a pressable wrapper component with tactile feedback.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder for a modal handling user profile setup.",
  "frontend/src/components/ProSalonWizard.tsx": "Empty placeholder for a multi-step salon creation wizard.",
  "frontend/src/components/ProStudioCreator.tsx": "Empty placeholder for a pro studio salon creation interface.",
  "frontend/src/components/RevenueChart.tsx": "Empty placeholder for a revenue chart visualization.",
  "frontend/src/components/SalonListSection.tsx": "Empty placeholder for a salon list UI section.",
  "frontend/src/components/VipDashboard.tsx": "Empty placeholder for a VIP dashboard component.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching a backend actor based on Internet Identity, with automatic refetching when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider wrapping Dfinity AuthClient to manage Internet Identity login state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future query-related hooks.",
  "frontend/src/hooks/useSalonImage.ts": "Empty placeholder hook for salon image handling.",
  "frontend/src/index.css": "Tailwind base/theme variables and custom animation utilities for light/dark mode and UI effects.",
  "frontend/src/main.tsx": "Bootstraps React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Empty placeholder page for the client dashboard.",
  "frontend/src/pages/LoginPage.tsx": "Empty placeholder page for the login flow.",
  "frontend/src/pages/ProDashboardPage.tsx": "Empty placeholder page for the professional dashboard.",
  "frontend/src/pages/SalonDetailsPage.tsx": "Empty placeholder page intended to display detailed salon information.",
  "frontend/src/utils/auraGenerator.ts": "Generates descriptive marketing text for salons based on category, type, tags, and location.",
  "frontend/src/utils/currency.ts": "Empty utility file for currency helpers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and container settings with plugins.",
  "project_state.json": "Metadata describing the project's reset state, goals, architecture notes, and known issues."
}