{
  "backend/main.mo": "Defines core types and maps for salons, bookings, images, and user profiles, with seed logic for default Swiss salons and mixins for authorization and storage.",
  "feature_evidence.json": "Lists feature evidence entries describing required frontend behaviors, affected files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Contains a JSON-like mapping of frontend file paths to short descriptive summaries of their functionality.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color variables, dark mode overrides, and base element styling.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Minimal wrapper that renders and exports AppV1.",
  "frontend/src/AppV1.jsx": "Main UI implementing the V25 AETHER GENESIS experience with salon data, Helix navigation, filtering, galleries, and interactive components.",
  "frontend/src/components/AuthHeader.tsx": "Empty placeholder file for the AuthHeader component.",
  "frontend/src/components/CreateSalonForm.tsx": "Empty placeholder file for the CreateSalonForm component.",
  "frontend/src/components/MemberCard.tsx": "Empty placeholder file for the MemberCard component.",
  "frontend/src/components/MonopolyModeSwitch.tsx": "Empty placeholder file for the MonopolyModeSwitch component.",
  "frontend/src/components/MotionButton.tsx": "Empty placeholder file for the MotionButton component.",
  "frontend/src/components/PremiumBadge.tsx": "Empty placeholder file for the PremiumBadge component.",
  "frontend/src/components/Pressable.tsx": "Empty placeholder file for the Pressable component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file for the ProfileSetupModal component.",
  "frontend/src/components/ProSalonWizard.tsx": "Empty placeholder file for the ProSalonWizard component.",
  "frontend/src/components/ProStudioCreator.tsx": "Empty placeholder file for the ProStudioCreator component.",
  "frontend/src/components/RevenueChart.tsx": "Empty placeholder file for the RevenueChart component.",
  "frontend/src/components/SalonListSection.tsx": "Empty placeholder file for the SalonListSection component.",
  "frontend/src/components/VipDashboard.tsx": "Empty placeholder file for the VipDashboard component.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching a backend actor tied to Internet Identity, with auto-initialization of access control and cache invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login state using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useSalonImage.ts": "Empty placeholder hook file.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light/dark theme variables and custom animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Empty placeholder page file.",
  "frontend/src/pages/LoginPage.tsx": "Empty placeholder page file.",
  "frontend/src/pages/ProDashboardPage.tsx": "Empty placeholder page file.",
  "frontend/src/pages/SalonDetailsPage.tsx": "Empty placeholder page file.",
  "frontend/src/utils/auraGenerator.ts": "Generates marketing-style salon descriptions based on category, tags, type, and city.",
  "frontend/src/utils/currency.ts": "Empty placeholder utility file.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session storage values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins including typography and container queries.",
  "project_state.json": "Project state metadata describing version, architectural resets, UX direction, and known issues."
}