{
  "backend/main.mo": "Defines core backend types for salons, bookings, users, images, and seeds Swiss salons with default availability and services, integrating authorization and storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files and components for build validation.",
  "frontend-file-summaries.txt": "Provides human-written summaries of various frontend components, pages, hooks, and styles.",
  "frontend/index.css": "Sets global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Thin root wrapper that imports and renders AppV1.",
  "frontend/src/AppV1.jsx": "Main UI containing ETHEREAL FLOW layout, seed DATA, cards, badges, and interactive salon browsing logic.",
  "frontend/src/components/AuthHeader.tsx": "Empty placeholder file for the AuthHeader component.",
  "frontend/src/components/CreateSalonForm.tsx": "Empty placeholder file for the CreateSalonForm component.",
  "frontend/src/components/MemberCard.tsx": "Empty placeholder file for the MemberCard component.",
  "frontend/src/components/MonopolyModeSwitch.tsx": "Empty placeholder file for the MonopolyModeSwitch component.",
  "frontend/src/components/MotionButton.tsx": "Empty placeholder file for the MotionButton component.",
  "frontend/src/components/PremiumBadge.tsx": "Empty placeholder file for the PremiumBadge component.",
  "frontend/src/components/Pressable.tsx": "Empty placeholder file for the Pressable component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file for the ProfileSetupModal component.",
  "frontend/src/components/ProSalonWizard.tsx": "Empty placeholder file for the ProSalonWizard component.",
  "frontend/src/components/ProStudioCreator.tsx": "Empty placeholder file for the ProStudioCreator component.",
  "frontend/src/components/RevenueChart.tsx": "Empty placeholder file for the RevenueChart component.",
  "frontend/src/components/SalonListSection.tsx": "Empty placeholder file for the SalonListSection component.",
  "frontend/src/components/VipDashboard.tsx": "Empty placeholder file for the VipDashboard component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, with query invalidation on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider for managing Internet Identity login using AuthClient, exposing identity, login flow state, and utility helpers.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future query-related React hooks.",
  "frontend/src/hooks/useSalonImage.ts": "Empty placeholder hook file for salon image handling.",
  "frontend/src/index.css": "Main Tailwind CSS setup defining theme variables, dark mode, base styles, utilities, and custom animations.",
  "frontend/src/main.tsx": "Application entry rendering App with React Query and InternetIdentityProvider.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Empty placeholder page for the client dashboard.",
  "frontend/src/pages/LoginPage.tsx": "Empty placeholder page for the login view.",
  "frontend/src/pages/ProDashboardPage.tsx": "Empty placeholder page for the professional dashboard.",
  "frontend/src/pages/SalonDetailsPage.tsx": "Empty placeholder page for salon details.",
  "frontend/src/utils/auraGenerator.ts": "Generates marketing aura descriptions from salon form data using category, type, tags, and location.",
  "frontend/src/utils/currency.ts": "Empty placeholder utility file for currency functions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling themes, custom colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Project state metadata describing reset strategy, frontend redesign iterations, and known issues."
}