{
  "kind": "build_request",
  "title": "V66 NEXUS FREEDOM: overwrite AppV1 with freelance/mobile-home-studio sequential booking flow + Mirror terminal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-208",
      "text": "Completely delete the current contents of `frontend/src/AppV1.jsx` and replace the entire file with the exact V66 “NEXUS FREEDOM” code provided by the user, treating it as the full frontend application UI/logic (Intro → Client app feed → Artist detail booking tunnel → Pro Creator Studio), with local-only in-file demo data and no backend calls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "INSTRUCTION : Efface tout le contenu actuel de `frontend/src/AppV1.jsx` et remplace-le par le code ci-dessous."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` is a full-file overwrite and matches the user-provided V66 code (same components, constants, Tailwind classes, and UI strings), except for any strictly build-breaking mechanical fixes covered by REQ-209.",
        "`frontend/src/App.tsx` continues to render `AppV1` unchanged, so the app still mounts via the existing Vite/React wiring.",
        "The app runs purely in frontend state using `INITIAL_ARTISTS` / `PRESETS` without calling Motoko canister methods or React Query hooks."
      ]
    },
    {
      "id": "REQ-209",
      "text": "Ensure the V66 implementation compiles and runs in this repository by applying only minimal mechanical adjustments required by the repo’s wiring/dependencies (e.g., missing/incorrect imports, undefined identifiers, invalid JSX, duplicate default exports) without changing the intended V66 UI design, copy, datasets, or interaction behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "**VOICI LE CODE V66 COMPLET À ÉCRIRE :**"
        ]
      },
      "acceptanceCriteria": [
        "`npm run build` (or equivalent CI build) succeeds without TypeScript/JSX compilation errors.",
        "All referenced symbols from `react`, `framer-motion`, and `lucide-react` used in JSX are properly imported (or unused imports removed only if they break the build).",
        "No changes are made to frontend immutable entry files listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-210",
      "text": "Preserve and verify the V66 sequential booking tunnel and freelance-specific “Location” logic: Services → Location (at client vs at pro) → Date/Time → Identity → Pending (3-second simulated validation) → Final ticket; the “Location” step must be required and the Identity step must require an address only when the user selected ‘at client’.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "**LES 4 PILIERS DE LA V66 :**\n1.  **LOGIQUE \"LIEU\"** : Dans le tunnel de réservation, ajout d'une étape critique : \"Où se fait la prestation ?\" (Chez le Client ou Chez le Pro).\n...\n4.  **FLUX SÉQUENTIEL** : Services -> Lieu -> Date -> Identité -> Attente Validation -> Ticket Final."
        ]
      },
      "acceptanceCriteria": [
        "From an artist detail screen, selecting at least one service enables advancing to the Location step.",
        "On the Location step, the user can only choose options that the selected artist supports (`acceptsMobile` enables “at client”, `acceptsStudio` enables “at pro”), and cannot proceed until one option is selected.",
        "On the Date/Time step, the user cannot proceed until both a day and time are selected.",
        "On the Identity step, the user cannot send the request until name and phone are provided; address is additionally required and collected only when location is “at client”.",
        "Sending the request shows the Pending screen and automatically transitions to the Final ticket after ~3 seconds."
      ]
    },
    {
      "id": "REQ-211",
      "text": "Preserve and verify the V66 “Creator Studio” (Pro space) flow: the user can enter Creator Studio from the intro, configure whether the freelance works as “Mobile” and/or “Home Studio”, add services (including preset suggestions), and deploy a new artist that appears immediately in the client feed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2.  **CREATOR STUDIO (RETOUR)** : L'espace Pro est réintégré. Le freelance configure s'il est \"Mobile\" (déplacement) ou \"Home Studio\" (reçoit)."
        ]
      },
      "acceptanceCriteria": [
        "From the Intro screen, the “Creator space” entry opens the Creator Studio screen.",
        "In Creator Studio step 1, toggling the two work-mode buttons updates `acceptsMobile` / `acceptsStudio` in the preview state.",
        "In Creator Studio step 2, clicking a preset adds a service entry to the preview list and the service list supports deletion.",
        "Finishing/deploying creates a new artist and injects it into the in-memory `artists` list so it appears at the top of the client feed immediately, without requiring a refresh."
      ]
    },
    {
      "id": "REQ-212",
      "text": "Make the Pro deploy/injection state update robust against stale React state closures in the V66 deploy path by using a functional state update for `setArtists`, while preserving identical visible behavior (newly created artist appears immediately at the top and the view switches to the client app).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "const handleProDeploy = (newArtist) => {\n      if(newArtist) {\n          const artistWithId = { ...newArtist, id: Date.now(), verified: true, priceStart: newArtist.services[0]?.price || 0 };\n          setArtists([artistWithId, ...artists]);\n          setView('app');\n      } else {\n          setView('intro');\n      }\n  };"
        ]
      },
      "acceptanceCriteria": [
        "Deploying multiple times in quick succession never loses an injected artist due to stale state; each deployed artist reliably appears in the feed.",
        "Visible behavior remains the same as V66: after deploy, the app switches to the client feed and the new artist is at the top."
      ]
    },
    {
      "id": "REQ-213",
      "text": "Preserve and verify the V66 “Mirror Protocol” terminal behavior: the Mirror Protocol is presented as the freelancer’s official payment terminal and must only be accessible after the final booked ticket step; opening it before the booking is confirmed must not be possible via the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "3.  **TERMINAL \"MIRROR\"** : Le Mirror Protocol est présenté comme l'outil d'encaissement officiel du freelance (plus de cash, plus de risque)."
        ]
      },
      "acceptanceCriteria": [
        "During Services/Location/Date-Time/Identity/Pending steps, there is no visible UI control that opens Mirror Protocol.",
        "On the Final ticket screen, the “Pay (Mirror)” action opens `MirrorProtocol` and shows the total amount derived from the selected services.",
        "Completing Mirror Protocol calls the provided `onFinish` behavior (closes Mirror and resets/returns to the feed via the existing V66 logic)."
      ]
    }
  ],
  "constraints": [
    "Do not modify `frontend/src/App.tsx`; it must remain the thin wrapper that renders `AppV1`.",
    "Do not modify any frontend immutable entry files listed in SYSTEM_CONTEXT.",
    "Keep the V66 frontend as local-only demo logic (no backend calls / no Internet Identity flow changes).",
    "When fixing issues, apply only minimal mechanical adjustments required for compilation; do not refactor or redesign the provided V66 UI/UX."
  ],
  "nonGoals": [
    "Re-introducing Internet Identity authentication, role-based routing, or React Query data loading.",
    "Implementing Motoko backend changes (artists/freelancers, bookings, persistence, payments).",
    "Adding new product features beyond what exists in the provided V66 code (e.g., real payments, real chat, real-time updates)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}