{
  "kind": "build_request",
  "title": "V14 “DIVINE OS” local-demo reset: overwrite AppV1.jsx with provided code (verbatim)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-65",
      "text": "Replace the entire contents of `frontend/src/AppV1.jsx` with the user-provided V14 “DIVINE OS” code block exactly as given (verbatim), with a full overwrite of the file.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "MODE D'ÉCRITURE : Copie le code ci-dessous strictement verbatim. Remplace tout le contenu existant.",
          "CIBLE DU FICHIER : Oui, écris le code dans frontend/src/AppV1.jsx.",
          "RESET TOTAL : ... Je veux que cette version fonctionne en mode 100% local (Démo) ..."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` content matches the provided V14 code block exactly (full file overwrite; no partial merges).",
        "No backend calls are introduced by the new `AppV1` implementation; all behavior is driven by local React state only.",
        "The app renders the Landing screen first and allows switching to Client (\"Explorer\") and Pro (\"Créer\") flows per the injected code."
      ]
    },
    {
      "id": "REQ-66",
      "text": "Ensure the application compiles and runs after the `AppV1.jsx` overwrite while preserving the injected UI/behavior; do not change any immutable entry files and keep `frontend/src/App.tsx` as the thin wrapper that renders `AppV1`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ignore le backend, l'authentification ou les drafts précédents.",
          "Oui, écris le code dans frontend/src/AppV1.jsx. C'est le point d'entrée que je veux modifier."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/App.tsx` remains a thin wrapper rendering `AppV1` (no entry wiring changes).",
        "Production build/dev server succeeds without runtime errors on initial load.",
        "In the Client view: (a) toggling a heart updates Favorites state and Favorites tab renders the favorite salons; (b) clicking the trash icon removes a salon card from the feed; (c) clicking a service adds a booking entry and navigates to the Agenda tab; (d) completing ProWizard and clicking “DÉPLOYER” injects the new salon into the Client feed and it appears in the Stories rail list during the same session."
      ]
    }
  ],
  "constraints": [
    "Do not modify any immutable frontend paths (e.g., `frontend/src/main.tsx`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, or anything under `frontend/src/components/ui`).",
    "Do not add or rely on backend canister methods; this V14 must be a 100% local demo driven by React state only.",
    "Do not implement or re-enable previous advanced features (Internet Identity auth, role-based routing, React Query data layer, backend persistence, on-chain image upload, etc.) as part of this reset."
  ],
  "nonGoals": [
    "Migrating the V14 demo UI to use Motoko backend data or persistence.",
    "Adding Internet Identity authentication or role-based routing.",
    "Internationalizing or changing any of the UI strings contained in the injected V14 code block.",
    "Adding new product features beyond what exists in the provided V14 code (e.g., search, category filtering, real booking availability)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}