{
  "kind": "build_request",
  "title": "Critical update: Overwrite AppV1 with V45 “NEXUS ELITE POLISH” and ensure it builds",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-147",
      "text": "Fully overwrite `frontend/src/AppV1.jsx` with the exact user-provided V45 “NEXUS ELITE POLISH” code block (full file replacement), preserving its components, local seed data (`INITIAL_SALONS`, `PRESETS`), Tailwind classes, imports, UI strings, and interaction logic as provided.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-message-v45"
        ],
        "quotes": [
          "INSTRUCTION : Remplace INTÉGRALEMENT le code de `frontend/src/AppV1.jsx`.",
          "CODE V45 :\n\nimport React, { useState, useEffect, useRef } from 'react';\nimport { motion, AnimatePresence } from 'framer-motion';\n..."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` contents exactly match the V45 code provided by the user (no partial merges).",
        "`frontend/src/App.tsx` continues to render `AppV1` as the app root (wrapper remains unchanged).",
        "No backend calls are introduced; the app remains a local-state demo driven by the in-file data structures."
      ]
    },
    {
      "id": "REQ-148",
      "text": "Ensure the project compiles and runs after the V45 overwrite by applying only minimal mechanical fixes required by this repository (e.g., missing/incorrect imports, unresolved identifiers, invalid JSX, duplicate default exports), without changing the intended V45 UI layout, styling, copy, or interaction behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-message-v45"
        ],
        "quotes": [
          "MISE À JOUR CRITIQUE : V45 \"NEXUS ELITE POLISH\".",
          "Objectif : Calibrage mobile parfait (fix du bouton Domicile), branding haut de gamme (textures, glassmorphism) et copywriting vendeur pour convertir."
        ]
      },
      "acceptanceCriteria": [
        "`npm run build` (or equivalent CI build) succeeds with the V45 `AppV1.jsx` code in place.",
        "The app loads in the browser without runtime errors (blank screen, red error overlay, or console exceptions).",
        "Any changes made beyond the overwrite are limited to build-breaking mechanical fixes only (no refactors, no feature additions)."
      ]
    },
    {
      "id": "REQ-149",
      "text": "Preserve and verify the V45 visual changes in the running app: (1) mobile-perfect alignment for the Salon/Domicile selector implemented with a 2-column grid (no overflow), (2) premium textures via subtle gradients + transparency/glassmorphism on cards and surfaces, and (3) revamped Pro landing with a large background image, larger sales-oriented typography, and an airier, confident layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-message-v45"
        ],
        "quotes": [
          "LES CHANGEMENTS VISUELS :\n1. FIX UI MOBILE : Le sélecteur Salon/Domicile utilise une `grid` pour un alignement parfait sans débordement.\n2. TEXTURES PREMIUM : Ajout de dégradés subtils et d'effets de transparence (glassmorphism) sur les cartes.\n3. PRO LANDING REVAMP : Grande image de fond, textes plus gros et plus \"vendeurs\", design plus aéré et confiant."
        ]
      },
      "acceptanceCriteria": [
        "On mobile viewport widths (~360–430px), the Salon/Domicile selector renders as a 2-column grid with equal-width buttons and no horizontal overflow/clipping.",
        "Cards/surfaces show the intended gradient + glass/blur treatments as defined by the provided Tailwind classes (no regression to flat solid cards).",
        "Entering the Pro experience shows the revamped Pro landing/welcome state with the large background image and larger marketing typography as in V45."
      ]
    }
  ],
  "constraints": [
    "Do not modify `frontend/src/App.tsx`; it must remain the thin wrapper that renders `AppV1`.",
    "Do not edit any frontend immutable entry files listed in `SYSTEM_CONTEXT.frontend.immutablePaths`.",
    "Keep the V45 implementation as a local-state demo (no new backend integration).",
    "Use English for all user-facing text in this build request document (do not translate/alter the app’s in-code UI strings unless required for build)."
  ],
  "nonGoals": [
    "Implementing or re-enabling Internet Identity authentication, role-based routing, or React Query data loading.",
    "Any backend (Motoko) changes, schema changes, persistence work, or migrations.",
    "Adding new product features beyond what exists in the provided V45 code (e.g., payments, real chat backend, push updates).",
    "Generating or editing image assets; V45 may continue to use external Unsplash image URLs as provided."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}