{
  "kind": "build_request",
  "title": "Replace AppV1 with V51 “NEXUS VIRAL” (share + WhatsApp conversion + Swiss smart location)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-168",
      "text": "Completely delete the current contents of `frontend/src/AppV1.jsx` and replace the entire file with the exact user-provided V51 “NEXUS VIRAL (Growth & Conversion)” code block (verbatim overwrite).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "INSTRUCTION : Efface tout le contenu actuel de `frontend/src/AppV1.jsx` et remplace-le par le code ci-dessous."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` contains exactly the provided V51 code, with no refactors, feature additions, or copy changes.",
        "The V51 implementation includes the four engines as coded: (1) native share via `navigator.share`, (2) WhatsApp deep-link booking, (3) Swiss ZIP↔city search suggestions, and (4) cinematic dark luxury UI styling.",
        "The app continues to mount via `frontend/src/App.tsx` rendering `AppV1` (no entrypoint rewiring)."
      ]
    },
    {
      "id": "REQ-169",
      "text": "Ensure the project compiles and runs after the V51 overwrite by applying only the minimum mechanical adjustments required by this repository (e.g., missing/incorrect imports, undefined identifiers, invalid JSX), without changing the intended V51 UI, styling (Tailwind classes), copy, or interaction behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "VOICI LE CODE V51 COMPLET À ÉCRIRE :"
        ]
      },
      "acceptanceCriteria": [
        "`npm`/Vite build succeeds with the new `AppV1.jsx` in place.",
        "No runtime crash occurs on initial load; the Landing screen renders and navigation to Client and Pro views works.",
        "Any fixes made are strictly mechanical (e.g., import corrections) and do not alter visual design, strings, or flow logic in the provided V51 code."
      ]
    }
  ],
  "constraints": [
    "Do not modify `frontend/src/App.tsx`; it must remain the thin wrapper that renders `AppV1`.",
    "Do not modify any frontend immutable entry files listed in the platform constraints (e.g., `frontend/src/main.tsx`, Internet Identity hooks, `frontend/src/components/ui`).",
    "Do not add backend calls; V51 must remain a local-only frontend demo as provided.",
    "Preserve the user-provided V51 code verbatim except for strictly build-blocking mechanical fixes."
  ],
  "nonGoals": [
    "Do not implement or re-enable Internet Identity authentication, role-based routing, or React Query data loading.",
    "Do not connect booking, salons, or sharing to the Motoko backend; no persistence beyond in-memory state unless explicitly present in the provided V51 code.",
    "Do not redesign the UI or translate/replace any in-app strings beyond what exists in the provided V51 code block."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}