{
  "kind": "build_request",
  "title": "V38 Genesis Architect: Full AppV1.jsx overwrite with Smart Presets + detailed Service Studio + split-view live preview",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-119",
      "text": "Completely replace (overwrite) the entire contents of `frontend/src/AppV1.jsx` with the exact V38 “GENESIS ARCHITECT” code block provided by the user, preserving components, local data (`INITIAL_SALONS`, `PRESETS`), Tailwind classes, imports, and interaction logic as given (treat it as the whole app UI: Landing → Client → Pro Studio).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "INSTRUCTION : Remplace INTÉGRALEMENT le code de `frontend/src/AppV1.jsx`.",
          "MISE À JOUR MAJEURE : V38 \"GENESIS ARCHITECT\".",
          "CODE V38 :"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` is a full overwrite with the provided V38 code (no partial merges).",
        "The application boots into the V38 landing screen and can navigate to Client and Pro views using only in-file local state (no backend calls).",
        "Smart Presets are present in the Pro studio: selecting/using a category shows preset service chips that add a service in one click.",
        "Detailed Service Studio is present: each service supports per-service image, technical description, duration, and price in the Pro studio and is rendered in the client service menu.",
        "Split-view is present on desktop widths: left side tools, right side live client preview panel."
      ]
    },
    {
      "id": "REQ-120",
      "text": "Ensure the V38 app compiles and runs in this repository by applying only minimal mechanical adjustments required by this codebase (e.g., missing/incorrect imports, unresolved identifiers, invalid JSX, duplicate default exports) without changing the intended V38 UI, layout, styling, copy, or interaction behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remplace INTÉGRALEMENT le code de `frontend/src/AppV1.jsx`."
        ]
      },
      "acceptanceCriteria": [
        "`npm test`/build (or the platform build) succeeds for the frontend without modifying immutable entry files.",
        "No runtime crash on initial render (landing view).",
        "Any fixes are limited to build-breakers (e.g., adding a missing import for a referenced symbol) and do not alter the provided UI/UX behavior."
      ]
    },
    {
      "id": "REQ-121",
      "text": "Make the Pro deploy/publish injection logic robust against stale React state closures in the V38 `handleDeploy` path by using a functional `setSalons(prev => [newSalon, ...prev])` update, while preserving identical visible behavior (new salon appears immediately at the top and the view switches to Client).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "const handleDeploy = (data) => { ... setSalons([newS, ...salons]); setView('client'); }"
        ]
      },
      "acceptanceCriteria": [
        "After deploying a new salon from the Pro studio, the new salon appears at the top of the client list immediately.",
        "Rapid successive deploy attempts do not lose the newly added salon due to stale state closures.",
        "The view still switches to Client immediately after a successful deploy, matching the provided behavior."
      ]
    }
  ],
  "constraints": [
    "Do not modify `frontend/src/App.tsx`; it must remain the thin wrapper that renders `AppV1`.",
    "Do not modify any frontend immutable entry files listed by the platform (e.g., `frontend/src/main.tsx`, Internet Identity hooks, `frontend/src/components/ui`).",
    "Keep the V38 implementation frontend-only/local-state (no backend integration added as part of this change).",
    "Use English in the build request text (this specification), even if the in-app UI strings in the provided code are French."
  ],
  "nonGoals": [
    "Do not integrate or re-enable Internet Identity authentication, role-based routing, or React Query data loading as part of this V38 overwrite.",
    "Do not add backend Motoko changes (salons persistence, bookings, availability, images, loyalty, monopoly mode) for this request.",
    "Do not refactor or redesign the provided V38 UI/UX beyond minimal build-fixing adjustments.",
    "Do not generate or edit images/assets; use the URLs and local file uploads already present in the provided V38 code."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}