{
  "kind": "build_request",
  "title": "V60 \"NEXUS DIVINE\" full overwrite of AppV1.jsx (Noir Lumière / Haute Couture / Liquid Gold)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-191",
      "text": "Completely delete the current contents of `frontend/src/AppV1.jsx` and replace the entire file with the exact V60 “NEXUS DIVINE” code block provided by the user (verbatim), treating it as the full app UI and local-only logic (Intro → App feed → Salon detail morph modal → Partner/Pro entry), including its imports, hardcoded datasets (`CATEGORIES`, `SALONS`), typography styling (`serifFont`), Framer Motion `layoutId` morphing, “Liquid Gold” service selection effect, and the Champagne Gold final CTA.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-msg-v60"
        ],
        "quotes": [
          "INSTRUCTION : Efface tout le contenu actuel de `frontend/src/AppV1.jsx` et remplace-le par le code ci-dessous.",
          "VOICI LE CODE V60 COMPLET À ÉCRIRE :"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` is a full-file overwrite containing exactly the user-provided V60 code (no refactors, no feature additions).",
        "The V60 flows exist as coded: Intro screen (PURE BEAUTY) → App feed with categories → selecting a salon opens the morphing detail overlay via `layoutId` → selecting services toggles the gold glow state → the final Champagne Gold CTA appears when at least one service is selected."
      ]
    },
    {
      "id": "REQ-192",
      "text": "Ensure the project compiles and runs after the V60 `AppV1.jsx` overwrite by applying only minimal mechanical fixes required by this repository (e.g., resolving missing/incorrect imports, undefined identifiers, invalid JSX, duplicate default exports) without changing the intended V60 UI layout, styling (Tailwind classes), copy, data, or interaction behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-msg-v60"
        ],
        "quotes": [
          "INSTRUCTION : Efface tout le contenu actuel de `frontend/src/AppV1.jsx` et remplace-le par le code ci-dessous."
        ]
      },
      "acceptanceCriteria": [
        "`npm run build` (or equivalent CI build) succeeds with the V60 `AppV1.jsx` in place.",
        "The app boots through the existing Vite/React entry wiring and renders the V60 Intro as the initial view.",
        "Any changes made beyond the AppV1 overwrite are strictly limited to build-breaking mechanical fixes and do not alter visible UI/UX or text."
      ]
    },
    {
      "id": "REQ-193",
      "text": "Keep `frontend/src/App.tsx` as the thin wrapper that renders `AppV1` and do not modify any frontend immutable entry files; the app must continue to mount through the existing `frontend/src/main.tsx` wiring.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-msg-v60"
        ],
        "quotes": [
          "Efface tout le contenu actuel de `frontend/src/AppV1.jsx` et remplace-le par le code ci-dessous."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/App.tsx` continues to only render `<AppV1 />` (no routing or provider changes added there).",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable entry files must not be modified (per SYSTEM_CONTEXT immutablePaths).",
    "Do not modify `frontend/src/App.tsx`; it must remain the thin wrapper that renders `AppV1`.",
    "Apply only minimal mechanical changes necessary to compile/run; do not change the provided V60 UI, interactions, or in-file data model.",
    "No backend integration work is included; the V60 app remains local-only and uses external image URLs as provided."
  ],
  "nonGoals": [
    "Do not implement or restore Internet Identity, role-based routing, React Query data fetching, or any backend-driven salon/booking persistence.",
    "Do not redesign or translate the V60 in-app UI text; preserve the user-provided strings exactly as they appear in the V60 code.",
    "Do not add new features (e.g., additional tabs, real-time updates, payments, or backend APIs)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text in build requests."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}