{
  "kind": "build_request",
  "title": "Overwrite AppV1 with V53 “NEXUS OLYMPUS” cinematic intro + viral sharing + WhatsApp booking",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-177",
      "text": "Delete all existing content of `frontend/src/AppV1.jsx` and replace the entire file with the exact V53 “NEXUS OLYMPUS” code block provided by the user (full overwrite), preserving components, local seed data (`SWISS_DB`, `SHOWREEL`, `INITIAL_SALONS`, `PROFESSIONS`, `RICH_PRESETS`), Tailwind classes, imports, UI strings, and interaction logic as given.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "INSTRUCTION : Efface tout le contenu actuel de `frontend/src/AppV1.jsx` et remplace-le par le code ci-dessous."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` matches the user-provided V53 code content as the application UI implementation (intro -> landing -> client -> pro studio).",
        "The app continues to mount via the existing `frontend/src/App.tsx` wrapper that renders `AppV1`."
      ]
    },
    {
      "id": "REQ-178",
      "text": "Ensure the project compiles and runs after the V53 overwrite by applying only minimal mechanical adjustments required by this repository (e.g., missing/incorrect imports, unresolved identifiers, invalid JSX, duplicate default exports), without changing the intended V53 UI layout, styling, copy, or interaction behavior, including the five pillars: Olympus Intro showreel, native share via `navigator.share`, WhatsApp `wa.me` deep-link booking, Swiss smart location suggestions, and dark cinematic UI with trust badges.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "LES 5 PILIERS DE LA V53 :",
          "1.  **OLYMPUS INTRO (SHOWREEL)**",
          "2.  **NATIVE VIRAL ENGINE**",
          "3.  **WHATSAPP DEEP LINK**",
          "4.  **SMART LOCATION**",
          "5.  **CINEMATIC UI**"
        ]
      },
      "acceptanceCriteria": [
        "Build succeeds with no TypeScript/JSX compile errors after the overwrite.",
        "On launch, the Olympus Intro showreel is displayed full-screen and only entering proceeds to the app.",
        "Tapping a Share action uses `navigator.share` when available; when unavailable, the fallback path executes without crashing.",
        "Confirming a booking generates a working WhatsApp `wa.me` link with a prefilled message that includes salon name, selected services, selected date/time, location context (including address for domicile), and total price.",
        "The location input shows suggestions by ZIP prefix or city substring using the in-file `SWISS_DB` dataset."
      ]
    }
  ],
  "constraints": [
    "Do not modify any frontend immutable entry files (including `frontend/src/main.tsx` and the hooks in `frontend/src/hooks/*` listed as immutable by the platform).",
    "Keep `frontend/src/App.tsx` as the thin wrapper that renders `AppV1` (no changes to app entry wiring).",
    "Do not add backend calls; keep the V53 implementation as local-only state/data as provided.",
    "Any changes beyond the V53 paste must be strictly limited to build-breaking mechanical fixes and must not alter intended UI/UX, styling, copy, or interaction behavior."
  ],
  "nonGoals": [
    "Implementing or re-enabling Internet Identity authentication, role-based routing, or React Query data loading.",
    "Connecting the V53 UI to the Motoko backend for salons/bookings/images.",
    "Changing V53 user-facing UI copy/language (the pasted V53 UI strings must remain as provided).",
    "Adding new features or refactoring the provided V53 code for optimization or architecture changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}