{
  "kind": "build_request",
  "title": "Overwrite AppV1 with V24 OMEGA SINGULARITY UI (morphing cards + orbital core nav)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-86",
      "text": "Completely replace the contents of `frontend/src/AppV1.jsx` with the exact V24 “OMEGA SINGULARITY” code provided by the user, treating it as the full application UI (Landing → Client → Pro/GenesisEngine) and preserving the provided components, local `DATA`, Tailwind classes, imports, and interaction logic (including Framer Motion `layoutId` morphing, the orbital CoreNav, the category slider, and the Vantablack aesthetic).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "INSTRUCTION : Remplace INTÉGRALEMENT le code de `frontend/src/AppV1.jsx`.",
          "LES 4 RUPTURES DE LA SINGULARITÉ : 1. MORPHING LIQUIDE ... via `layoutId` ... 2. ... Orbe Flottant ... menu circulaire ... 3. FILTRAGE \"HAPTIC SLIDER\" ... 4. ESTHÉTIQUE \"VANTABLACK\" ...",
          "CODE V24 :"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` is a full overwrite containing the V24 code as provided (no refactors or feature additions).",
        "The app still boots via the existing `frontend/src/App.tsx` wrapper rendering `AppV1` (no entry wiring changes).",
        "In the Client Home tab, clicking a salon compact card morphs into the full-screen expanded view using Framer Motion shared `layoutId` (no route/page navigation).",
        "The bottom orbital CoreNav is the primary navigation (Home/Agenda/Favorites) and expands/collapses into a circular menu from a central orb button.",
        "The top category slider controls filtering immediately and the UI remains predominantly pure black with high-contrast white typography per the provided styling."
      ]
    },
    {
      "id": "REQ-87",
      "text": "Ensure the project compiles and runs after the V24 `AppV1.jsx` overwrite by applying only minimal mechanical fixes required by this repository (e.g., missing/incorrect imports, unresolved symbols, invalid JSX, duplicate `export default`), without changing the intended UI design, copy, or interaction behavior from the provided V24 code.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remplace INTÉGRALEMENT le code de `frontend/src/AppV1.jsx`."
        ]
      },
      "acceptanceCriteria": [
        "`npm`/Vite build succeeds with no unresolved symbol/import errors originating from `frontend/src/AppV1.jsx`.",
        "No changes are made to any frontend immutable entry files (including `frontend/src/main.tsx` and Internet Identity hooks).",
        "Only mechanical build-breaking issues are fixed; the visible UI/animations/flows remain consistent with the provided V24 implementation."
      ]
    }
  ],
  "constraints": [
    "Do not modify any frontend immutable paths (notably `frontend/src/main.tsx`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, and anything under `frontend/src/components/ui`).",
    "Keep `frontend/src/App.tsx` as the thin wrapper that renders `AppV1` and do not change the app entry mounting.",
    "Do not introduce backend calls or React Query-driven data flows into the V24 UI; keep the app’s behavior strictly local-state as in the provided code.",
    "Use English for any user-facing text in this build request document (implementation may remain as provided by the user)."
  ],
  "nonGoals": [
    "Backend/Motoko changes of any kind (no schema, persistence, seeding, booking logic, image upload, or auth changes).",
    "Re-introducing previously implemented advanced features (Internet Identity login UX, role routing, React Query salon fetching, on-chain image storage, loyalty, bookings persistence, monopoly mode).",
    "Design changes beyond what is strictly required to make the pasted V24 code compile in this repository."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}