{
  "kind": "build_request",
  "title": "V37 “NEXUS PRO MAX”: Full overwrite AppV1 with Service Architect + Multi-service Cart + Schedule Matrix",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-117",
      "text": "Fully replace (overwrite) the entire contents of `frontend/src/AppV1.jsx` with the exact V37 “NEXUS PRO MAX” code block provided by the user, treating it as the complete application UI (Landing → Client → Pro Studio) and preserving its components, local seed data (`INITIAL_SALONS`), Tailwind classes, imports, UI strings, and interaction logic as provided.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "INSTRUCTION : Remplace INTÉGRALEMENT le code de `frontend/src/AppV1.jsx`.",
          "CODE V37 : (full code block)"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` is a full overwrite of the user-provided V37 code block (no partial merges).",
        "The app boots via the existing `frontend/src/App.tsx` wrapper and shows the V37 Landing screen.",
        "The V37 Client flow works: selecting a salon opens details; selecting multiple services updates the sticky cart totals (price and duration) in real time; clicking the cart CTA closes the detail view as in the provided code.",
        "The V37 Pro flow works: opening “Pro” shows the TitanStudio with Identity/Services/Availability tabs; adding services supports photo, technical description, duration, and price; publishing injects the new salon into the client list as in the provided code.",
        "The Schedule/Availability selections in Pro (e.g., Nocturne/Dimanche/Lundi tags) appear as availability/tag badges on the salon card in the client list, consistent with the provided code."
      ]
    },
    {
      "id": "REQ-118",
      "text": "Ensure the V37 app compiles and runs in this repository by applying only minimal mechanical adjustments required by this codebase (e.g., missing/incorrect imports, unresolved symbols, invalid JSX, duplicate exports), without changing the intended V37 UI design, copy, or interaction behavior. Additionally, make the Pro “Publish” salon injection robust against stale React state closures by using a functional `setSalons(prev => [newSalon, ...prev])` update while preserving identical visible behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "appliquer uniquement les ajustements mécaniques nécessaires pour compiler, sans changer le design ni la logique",
          "const handleDeploy = (data) => { ... setSalons([newS, ...salons]); ... }"
        ]
      },
      "acceptanceCriteria": [
        "`npm run build` (or the project’s equivalent build) succeeds without runtime errors caused by missing imports or undefined identifiers introduced by the V37 paste.",
        "No refactors/feature additions are introduced beyond what is necessary to make the pasted V37 code compile and run in this repo.",
        "Publishing a salon from the Pro studio always injects the new salon at the top of the client list, even after rapid successive publishes/navigation, with the same visible behavior (new salon on top and view switches to Client)."
      ]
    }
  ],
  "constraints": [
    "Do not modify `frontend/src/App.tsx`; it must remain the thin wrapper that renders `AppV1`.",
    "Do not modify any frontend immutable entry files or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Implement this as a frontend-only, local-state demo flow (no new backend calls added as part of this V37 overwrite)."
  ],
  "nonGoals": [
    "Do not implement or restore Internet Identity authentication, role-based routing, React Query data loading, or Motoko backend integration as part of this V37 overwrite.",
    "Do not add persistence beyond what is already present in the provided V37 code (e.g., no new localStorage/sessionStorage unless required for a build fix).",
    "Do not change V37 UI text/copy to English; preserve the user-provided UI strings in the pasted code."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text in build requests/specs."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}