{
  "kind": "build_request",
  "title": "Full project reset: replace backend and frontend with user-provided V1.0 files",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-40",
      "text": "Perform a complete backend reset by deleting the existing Motoko backend implementation and replacing it entirely with the user-provided `backend/main.mo` source code, treating it as the official V1.0 backend.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "OUI, supprime l'intégralité du backend existant et remplace-le par le code backend/main.mo que je t'ai fourni.",
          "C'est un RESET COMPLET. Considère ces fichiers comme la nouvelle V1.0 Officielle du projet."
        ]
      },
      "acceptanceCriteria": [
        "`backend/main.mo` matches the user-provided code exactly (no partial merges with the previous backend).",
        "The backend canister compiles successfully after the replacement.",
        "No state-migration work is implemented for the previous backend state (the reset intentionally discards old persistence)."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Perform a complete frontend reset by removing the existing frontend application code and replacing the app’s root component with the user-provided `src/App.jsx` code as the official V1.0 UI, while respecting platform constraints on immutable files by wiring the new app through editable entry points only.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "OUI, supprime l'intégralité du frontend existant et remplace-le par le code src/App.jsx que je t'ai fourni.",
          "C'est un RESET COMPLET. Considère ces fichiers comme la nouvelle V1.0 Officielle du projet."
        ]
      },
      "acceptanceCriteria": [
        "The root rendered UI matches the user-provided `src/App.jsx` behavior and structure as the new V1.0 baseline (not the prior multi-page app).",
        "No edits are made to files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or `frontend/src/components/ui` (immutable paths); if the new app must be mounted, it is done via editable files (e.g., `frontend/src/App.tsx` and/or new files) without modifying immutable paths.",
        "The frontend builds successfully with the current toolchain (React + TypeScript + Tailwind)."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Treat the reset as a hard cutover: remove/disable all previously implemented advanced features and code paths (e.g., Internet Identity auth, role-based routing, React Query data layer, bookings/availability/monopoly mode logic, on-chain image upload, loyalty/VIP dashboard, seeded premium salons logic) unless they exist in the two user-provided V1.0 files.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Ne t'inquiète pas pour l'ancien code ou la persistance, je veux repartir sur une base saine et propre.",
          "C'est un RESET COMPLET."
        ]
      },
      "acceptanceCriteria": [
        "The app no longer references previous feature modules/components/hooks/routes that are not part of the user-provided V1.0 files.",
        "The repository compiles and runs end-to-end (frontend + backend) after the reset without relying on any of the previously built feature code."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files listed as immutable: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Backend must remain a single-actor Motoko architecture with all logic in `backend/main.mo`.",
    "Do not add `backend/migration.mo`; the reset explicitly discards old state and does not preserve prior deployed data."
  ],
  "nonGoals": [
    "Preserving or migrating any existing canister state, stable memory data, or previously implemented backend persistence.",
    "Keeping Internet Identity authentication, role-based routing, React Query caching, bookings, availability slot management, monopoly mode pricing, image upload/retrieval, loyalty/XP, premium badges, or any other previously implemented features unless they are included in the user-provided V1.0 files.",
    "Incremental refactors of the pre-reset codebase (this is a total replacement)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}