{
  "kind": "build_request",
  "title": "Overwrite AppV1 with V65 Nexus Professional (Date/Time + Identity steps)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-204",
      "text": "Completely delete the current contents of `frontend/src/AppV1.jsx` and replace the entire file with the exact user-provided V65 “NEXUS PROFESSIONAL” code block (verbatim), preserving all components, local data constants, imports, Tailwind classes, UI strings, and interaction logic as provided.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "INSTRUCTION : Efface tout le contenu actuel de `frontend/src/AppV1.jsx` et remplace-le par le code ci-dessous.",
          "VOICI LE CODE V65 COMPLET À ÉCRIRE :"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` content matches the provided V65 code block exactly (full overwrite, no partial merge).",
        "The app still boots through the existing `frontend/src/App.tsx` wrapper (no entry wiring changes)."
      ]
    },
    {
      "id": "REQ-205",
      "text": "Ensure the project compiles and runs after the V65 overwrite by applying only minimal mechanical fixes required by this repository (e.g., fixing missing/incorrect imports, resolving undefined identifiers, invalid JSX, duplicate default exports) without changing the intended V65 UI, styling, copy, datasets, or interaction behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "L'utilisateur signale que l'app n'est pas fonctionnelle car il manque la sélection de la date/heure et l'identification du client."
        ]
      },
      "acceptanceCriteria": [
        "`npm run build` and `npm run dev` succeed without runtime errors.",
        "Any changes beyond the verbatim V65 overwrite are limited strictly to build-breaking mechanical fixes."
      ]
    },
    {
      "id": "REQ-206",
      "text": "Preserve and verify the V65 sequential booking flow in local-only state: Service selection → Date/Time picker → Client identity form → Request submission → Pending (3s simulation) → Booked ticket → Mirror Protocol. The payment/reveal (Mirror Protocol) must not be accessible before the booked ticket step.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "LOGIQUE SÉQUENTIELLE : Selection -> DateTime -> Identity -> Request -> Pending -> Booked -> Mirror Protocol."
        ]
      },
      "acceptanceCriteria": [
        "After selecting at least one service, the next step is a Date/Time screen where a day and a time slot can be selected.",
        "The user cannot proceed from Date/Time to the next step unless a time slot is selected.",
        "After Date/Time, an Identity screen collects client name and phone; the user cannot submit the request unless both fields are non-empty.",
        "Submitting the request shows a Pending screen and automatically transitions to Booked after ~3 seconds.",
        "The “Pay & Reveal” / Mirror Protocol entry point is only available on the Booked ticket screen (not during selection, datetime, identity, or pending)."
      ]
    },
    {
      "id": "REQ-207",
      "text": "Ensure the final booked ticket displays the user-selected date and time (from the Date/Time step) and the client identity (from the Identity step), as implemented in the provided V65 code.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "TICKET FINAL : Le ticket de réservation affiche désormais la date et l'heure choisies."
        ]
      },
      "acceptanceCriteria": [
        "The booked ticket UI shows the selected day label and selected time slot.",
        "The booked ticket UI shows the entered client name alongside the selected date/time (per the V65 UI)."
      ]
    }
  ],
  "constraints": [
    "Do not modify `frontend/src/App.tsx`; it must remain the thin wrapper that renders `AppV1`.",
    "Do not modify any frontend immutable entry files (including `frontend/src/main.tsx` and the hooks under `frontend/src/hooks/*` listed as immutable).",
    "Keep behavior local-only (no backend calls) as implied by the provided V65 in-file dataset and logic.",
    "Use English for all user-facing text in this build request (specification only); do not reinterpret or rewrite the UI strings inside the provided V65 code block."
  ],
  "nonGoals": [
    "Do not re-introduce Internet Identity, role-based routing, React Query data loading, or any prior backend-driven features unless they already exist inside the provided V65 code block.",
    "Do not refactor, rename, or reorganize the V65 code for style/architecture; only minimal build-fix edits are allowed if necessary.",
    "Do not add new product features beyond the V65 Date/Time picker, Identity form, sequential flow, and ticket changes already present in the provided code."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}