{
  "kind": "build_request",
  "title": "Critical update: Replace AppV1 with V43 “NEXUS SECURE CONNECT” (logistics address + secure chat + privacy UI)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-139",
      "text": "Fully overwrite `frontend/src/AppV1.jsx` with the exact user-provided V43 “NEXUS SECURE CONNECT” code block (verbatim replacement of the entire file).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "INSTRUCTION : Remplace INTÉGRALEMENT le code de `frontend/src/AppV1.jsx`.",
          "MISE À JOUR CRITIQUE : V43 \"NEXUS SECURE CONNECT\".",
          "CODE V43 :"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` contents match the provided V43 code (full-file overwrite; no partial merges).",
        "No changes are made to `frontend/src/App.tsx`; it remains a thin wrapper that renders `AppV1`.",
        "The app boots and renders the V43 UI (Landing → Client → Pro) using local in-file data only (no backend calls introduced)."
      ]
    },
    {
      "id": "REQ-140",
      "text": "Ensure the V43 UI compiles and runs in this repository by applying only the minimum mechanical fixes required by this codebase (e.g., missing/incorrect imports, undefined identifiers, invalid JSX), without changing the intended V43 UI layout, styling (Tailwind classes), copy, or interaction behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "`npm run build` (or equivalent) succeeds with no unresolved symbols referenced from `frontend/src/AppV1.jsx` (e.g., Framer Motion, lucide-react icons, React hooks).",
        "No immutable frontend entry files are modified (especially files under `frontend/src/hooks/*` listed as immutable and `frontend/src/main.tsx`)."
      ]
    },
    {
      "id": "REQ-141",
      "text": "Implement/verify the V43 booking request flow changes described by the user: (1) when a selected salon/service is of type “Domicile”, the client must complete the logistics form (address + access instructions) before the booking request can be sent; (2) after the request is sent, show the pending confirmation screen and provide a “Chat with the Pro” action that opens an in-app secure chat UI; (3) include privacy reassurance messaging indicating user data is only shared after confirmation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "FORMULAIRE LOGISTIQUE : Si le service est \"Domicile\", le client DOIT remplir son adresse + instructions d'accès avant d'envoyer la demande.",
          "SECURE CHAT : Après la demande, un bouton \"Discuter avec le Pro\" apparaît. C'est une interface de messagerie intégrée pour régler les détails (Parking, Code porte...).",
          "PRIVACY UI : Des mentions \"Vos données sont partagées uniquement après confirmation\" pour rassurer."
        ]
      },
      "acceptanceCriteria": [
        "For a salon with `type === \"Domicile\"`, attempting to proceed from service selection to sending a request requires the logistics form step to be completed first (address and access info must be non-empty).",
        "After a request is sent, the UI shows a pending/awaiting-confirmation screen and displays an action to open the secure chat interface.",
        "The secure chat UI supports sending messages in local state and can be closed to return to the pending screen.",
        "A privacy reassurance message is visible in the logistics step and/or pending flow, consistent with the V43 design."
      ]
    }
  ],
  "constraints": [
    "Frontend must continue to mount through existing Vite/React wiring; do not modify `frontend/src/App.tsx`.",
    "Do not edit any frontend immutable paths listed in SYSTEM_CONTEXT (compose them only if needed).",
    "Keep the implementation local-only (no new backend calls, no new Motoko changes) unless the user explicitly requests backend integration.",
    "Preserve the provided V43 visual design, Tailwind classes, and UI strings; only minimal mechanical/build fixes are allowed beyond the explicitly requested logistics/chat/privacy behaviors."
  ],
  "nonGoals": [
    "Do not implement real encrypted messaging or backend persistence for chat/messages; the secure chat is an in-app UI demo in local state only.",
    "Do not add Internet Identity, role-based routing, React Query data fetching, or any previously implemented advanced backend-driven features unless they are already present in the provided V43 code.",
    "Do not refactor or redesign the V43 UI beyond what is necessary to satisfy the required domicile logistics gating and the post-request chat CTA behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}