{
  "kind": "build_request",
  "title": "Replace AppV1.jsx with V34 “ETHEREAL FLOW” UI (Glass & Air, capsules + floating island, soft-touch expand, Pro split studio)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-109",
      "text": "Fully overwrite `frontend/src/AppV1.jsx` with the user-provided V34 “ETHEREAL FLOW” code block, treating it as the complete app UI and preserving the provided layout, styling (Tailwind classes), local seed data (`DATA`), and interaction logic (Landing → Client feed → Pro studio) as given.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "INSTRUCTION : Remplace INTÉGRALEMENT le code de `frontend/src/AppV1.jsx`.\n\nCODE V34 :\n\nimport React, { useState, useEffect, useRef } from 'react';\n..."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` contents are replaced end-to-end with the provided V34 code (not a partial merge).",
        "The app boots into the V34 flow (landing view visible first, with actions to enter Client or Pro).",
        "The Client view shows the top sticky capsule filters and the bottom floating island navigation as implemented in V34.",
        "Clicking a salon card expands into the full-screen detail overlay with shared `layoutId` transitions, and the booking CTA remains reachable at the bottom as implemented in V34.",
        "The Pro studio view renders the split editor/preview experience on desktop and behaves as provided in V34."
      ]
    },
    {
      "id": "REQ-110",
      "text": "Ensure the project compiles and runs after the V34 overwrite by applying only minimal mechanical fixes required by this repository (e.g., missing/incorrect imports, unresolved symbols, invalid JSX, duplicate exports) without changing the intended V34 UI, copy, or interaction behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use this as the entire app UI and replace `frontend/src/AppV1.jsx`."
        ]
      },
      "acceptanceCriteria": [
        "`npm run build` (or the repository’s standard build) succeeds without code changes outside minimal mechanical fixes.",
        "No runtime errors occur on initial load (Landing → Client → Pro navigation is usable).",
        "The existing `.hide-scrollbar` utility continues to work for the horizontal capsule scroller (no visible scrollbars in supported browsers)."
      ]
    },
    {
      "id": "REQ-111",
      "text": "Make the Pro “Deploy” action reliably inject the newly created salon at the top of the in-memory `salons` list by preventing stale state closures in the V34 `handleDeploy` path (use a functional `setSalons(prev => [newSalon, ...prev])` update) while keeping the visible behavior identical (new salon appears at the top and the view switches to Client immediately).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "const handleDeploy = (data) => {\n      if(data) {\n          const s = { ...data, id: Date.now(), rating: \"5.0\", reviews: 0 };\n          setSalons([s, ...salons]);\n          setView('client');\n      }\n  };"
        ]
      },
      "acceptanceCriteria": [
        "After clicking “Deploy” in Pro studio, the new salon appears immediately at the top of the Client feed without requiring refresh.",
        "Repeated deploys in a single session do not intermittently lose previously deployed salons due to stale state.",
        "The view still switches to Client immediately after deploy, matching V34 behavior."
      ]
    },
    {
      "id": "REQ-112",
      "text": "Do not modify `frontend/src/App.tsx` (it must remain the thin wrapper that renders `AppV1`) and do not change any frontend immutable entry files; the app must continue to mount through the existing Vite/React entry wiring.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remplace INTÉGRALEMENT le code de `frontend/src/AppV1.jsx`."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/App.tsx` remains a simple wrapper that renders `AppV1` and is unchanged.",
        "No files under the platform’s immutable frontend paths are modified.",
        "The application still mounts and renders through the existing entrypoint setup."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Keep `frontend/src/App.tsx` as the thin wrapper that renders `AppV1`.",
    "Apply only minimal mechanical adjustments needed to compile/run; do not refactor or redesign the provided V34 UI."
  ],
  "nonGoals": [
    "Do not add or re-enable backend integration, React Query data loading, or Internet Identity authentication unless it exists in the provided V34 code.",
    "Do not implement persistence beyond in-memory state (no backend calls, no local/session storage) unless explicitly present in V34.",
    "Do not change product copy/text from the V34 code (even if it is not English).",
    "Do not introduce new features beyond what is present in the V34 code block (e.g., real bookings backend, payments, notifications)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}