{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace AppV1 with V7000 NEXUS INFINITY (local-only discovery UI)",
  "requirements": [
    {
      "id": "REQ-289",
      "summary": "Replace frontend/src/AppV1.jsx with the exact user-provided V7000 “NEXUS INFINITY” implementation (verbatim), including datasets, discovery engine, modal, dock, and localStorage brain under key nexus_v7000.",
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` content matches the provided V7000 code block (no refactors or feature additions).",
        "The app boots through the existing `frontend/src/App.tsx` wrapper and renders the V7000 Landing screen when `state.view === 'LANDING'`.",
        "State is persisted to `localStorage` under the key `nexus_v7000` and a full page reload restores the last persisted `view`, `userRole`, `bookings`, `favorites`, `proProfile`, and `ledger` per the V7000 state shape."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Delete the entire current file content and replace it verbatim with the user-provided V7000 “NEXUS INFINITY” code block, including in-file datasets (CATEGORIES, PRO_DB), category rail + distance sort toggle + list↔map dual view, client bottom dock, booking modal overlay, and localStorage persistence using the key `nexus_v7000`."
        }
      ]
    },
    {
      "id": "REQ-290",
      "summary": "Apply only minimal mechanical build fixes needed for the V7000 AppV1.jsx to compile and run in this repo (imports, undefined identifiers, JSX validity) without changing intended UI, Tailwind styling, copy, datasets, or behavior.",
      "acceptanceCriteria": [
        "`npm test` is not required, but the Vite dev build compiles without errors related to `AppV1.jsx` (imports, undefined symbols, JSX syntax).",
        "Framer Motion imports used by V7000 (`motion`, `AnimatePresence`) resolve and the booking modal overlay animates in/out without runtime errors.",
        "Lucide icon imports used by V7000 resolve (including the `Navigation as NavIcon` alias and any icons referenced by JSX)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "After verbatim replacement, make minimal mechanical adjustments only if required to fix compilation/runtime issues in this repository (e.g., add/adjust missing imports for `motion`/`AnimatePresence`, fix lucide-react icon import names/aliases such as `Navigation as NavIcon`, resolve any undefined identifiers referenced in JSX, fix invalid JSX, ensure export shape matches what `frontend/src/App.tsx` expects). Do not change V7000 UI layout, Tailwind classes, user-facing copy, datasets, or interaction behavior."
        },
        {
          "path": "frontend/src/v7000-compat.notes.md",
          "operation": "create",
          "description": "Document any mechanical compatibility fixes applied to V7000 (limited to imports/JSX/export correctness) and explicitly note that no UI/copy/dataset/behavior changes were made, to support future regressions checks."
        }
      ]
    },
    {
      "id": "REQ-291",
      "summary": "Preserve existing entry wiring (App.tsx/main.tsx/immutable entry files remain unchanged) while continuing to mount and render AppV1.",
      "acceptanceCriteria": [
        "No changes are made to `frontend/src/App.tsx` (it remains a thin wrapper rendering `AppV1`).",
        "No changes are made to any files listed in the platform immutable paths (entry wiring remains intact)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/entry-wiring.guardrails.md",
          "operation": "create",
          "description": "Add a short guardrails note stating that `frontend/src/App.tsx`, `frontend/src/main.tsx`, and other immutable entry files must not be modified, and that the app must continue to render `AppV1` as the root component."
        }
      ]
    }
  ]
}