{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "V60 NEXUS DIVINE AppV1.jsx full overwrite + compile-safe wiring (frontend-only)",
  "requirements": [
    {
      "id": "REQ-191",
      "summary": "Full overwrite frontend/src/AppV1.jsx with the user-provided V60 “NEXUS DIVINE” code block verbatim as the complete local-only UI and logic.",
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` is a full-file overwrite containing exactly the user-provided V60 code (no refactors, no feature additions).",
        "The V60 flows exist as coded: Intro screen (PURE BEAUTY) → App feed with categories → selecting a salon opens the morphing detail overlay via `layoutId` → selecting services toggles the gold glow state → the final Champagne Gold CTA appears when at least one service is selected."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Delete all existing contents and replace the entire file with the exact V60 “NEXUS DIVINE” code block from user message `user-msg-v60` (verbatim, including imports, `CATEGORIES`/`SALONS`, `serifFont`, Framer Motion `layoutId` morphing, Liquid Gold selection effect, and final Champagne Gold CTA)."
        }
      ]
    },
    {
      "id": "REQ-192",
      "summary": "Ensure the app compiles and runs after the V60 overwrite using only minimal mechanical fixes that do not change V60 UI/UX, copy, or behavior.",
      "acceptanceCriteria": [
        "`npm run build` (or equivalent CI build) succeeds with the V60 `AppV1.jsx` in place.",
        "The app boots through the existing Vite/React entry wiring and renders the V60 Intro as the initial view.",
        "Any changes made beyond the AppV1 overwrite are strictly limited to build-breaking mechanical fixes and do not alter visible UI/UX or text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "If (and only if) the repository build fails after the verbatim V60 overwrite, apply the smallest possible mechanical adjustments inside this file strictly to resolve build-breaking issues (e.g., missing/incorrect imports, undefined identifiers, invalid JSX, conflicting exports) while preserving the V60 layout, styling (Tailwind classes), copy, in-file datasets, and interaction behavior exactly as intended."
        },
        {
          "path": "frontend/src/declarations.d.ts",
          "operation": "create",
          "description": "Add minimal TypeScript module declarations only if the build toolchain fails due to missing type declarations for libraries used by the V60 code (keep declarations minimal and non-invasive to avoid changing runtime behavior)."
        }
      ]
    },
    {
      "id": "REQ-193",
      "summary": "Keep frontend/src/App.tsx as the thin wrapper rendering AppV1 and do not modify immutable entry wiring; app continues to mount via frontend/src/main.tsx.",
      "acceptanceCriteria": [
        "`frontend/src/App.tsx` continues to only render `<AppV1 />` (no routing or provider changes added there).",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/__checks__/app-wrapper-contract.md",
          "operation": "create",
          "description": "Add a small internal check note documenting the wrapper contract: `App.tsx` must remain a thin renderer of `AppV1`, and mounting must remain through `main.tsx`. This exists to prevent accidental future edits; no entry files are modified."
        }
      ]
    }
  ]
}