{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "3-step Pro salon wizard, premium salon metadata UI, and client loyalty member card (frontend)",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Replace the Pro single-field salon creation with a 3-step wizard (Info → Services → Planning) that submits the full configuration and refreshes salons via React Query.",
      "acceptanceCriteria": [
        "The Pro dashboard no longer shows the single ‘Salon name’ input-only creation UI; it shows a 3-step wizard.",
        "Step 2 supports adding at least one service (example: “Men’s haircut”, 30 minutes, €35) and removing/editing services before submission.",
        "Step 3 captures opening hours in a way that the backend can generate availability slots for today and tomorrow (within those hours).",
        "Submitting the wizard creates a salon persisted in the canister and the salons list updates via React Query invalidation/refetch.",
        "All new and modified user-facing text in this wizard is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProSalonWizard.tsx",
          "operation": "create",
          "description": "Create a 3-step Pro salon configuration wizard UI (Step 1: name/neighborhood/description/photo URL(s) optional; Step 2: add/edit/remove services with label, durationMinutes, price; Step 3: opening hours inputs) and submit via the existing React Query mutation. Use shadcn-ui form components (e.g., Button/Input/Label and any existing textarea/select components) for consistent UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the salon creation mutation to match the current backend interface (createSalon(name, neighborhood, description, photoUrls, services, isPremium)) and accept the wizard payload. Keep React Query invalidation for ['salons'] after success."
        },
        {
          "path": "frontend/src/pages/ProDashboardPage.tsx",
          "operation": "modify",
          "description": "Replace CreateSalonForm with the new ProSalonWizard and update the related Pro create-salon section text to English (wizard-specific text must be English). Ensure the wizard is reachable from the existing Pro dashboard flow (no orphan component)."
        },
        {
          "path": "frontend/src/components/CreateSalonForm.tsx",
          "operation": "delete",
          "description": "Remove the legacy single-input Pro salon creation form to ensure it is no longer used in the Pro dashboard."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Update the client salon list UI to display data-driven salon photo, description, neighborhood, and premium status; avoid showing an empty-state under normal conditions by ensuring seeding is triggered from the client fetch path.",
      "acceptanceCriteria": [
        "Salon cards use the salon’s photoUrl field instead of a hardcoded image URL.",
        "Salon cards display the salon’s description and neighborhood (or equivalent fields) from the backend.",
        "When salons is empty due to unexpected conditions, show a neutral recovery message in English (error state remains), but normal startup should show the seeded salons.",
        "All modified user-facing strings in the salon list section are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden salon loading by calling the backend capability ensureSalonsSeeded() before reading salons (best-effort) and keep the query returning getSalons(). This supports the requirement that the UI does not normally show an empty list. Also keep all query enabling logic consistent with actor availability."
        },
        {
          "path": "frontend/src/components/SalonListSection.tsx",
          "operation": "modify",
          "description": "Render salon cards using backend salon metadata: use salon.photoUrls[0] (or first available photo) for images, show salon.description and salon.neighborhood, and remove hardcoded placeholder copy. Update loading/error/empty messaging to English (empty state should be a neutral recovery message)."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Display a loyalty ‘Member Card’ on the client Profile tab driven by backend user profile XP/tier, and refresh XP after a successful booking confirmation.",
      "acceptanceCriteria": [
        "Backend UserProfile includes an XP field (defaulting to 0 for existing/new users).",
        "After a successful booking confirmation, the user’s XP increases by a defined amount and remains increased after refresh/re-login.",
        "Client Profile tab displays a member card with current tier name and total XP, plus a progress bar toward the next tier.",
        "The member card UI is populated from backend profile data (no hardcoded demo user name/XP).",
        "All loyalty-related user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MemberCard.tsx",
          "operation": "create",
          "description": "Create a reusable ‘Member Card’ UI component that takes backend UserProfile (xp, tier) and renders: tier label (e.g., “Silver — 300 XP”) plus a progress bar toward next tier. Use shadcn-ui primitives where appropriate (e.g., Card/Progress if available). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ClientDashboardPage.tsx",
          "operation": "modify",
          "description": "Replace the hardcoded profile display in the Profile tab with backend-driven data (via existing useGetCallerUserProfile hook): show the user’s name and include the new MemberCard component. Ensure loyalty/member-card user-facing strings are in English."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update booking mutation success handling to also invalidate/refetch the current user profile query (e.g., ['currentUserProfile']) so XP updates appear immediately after a confirmed booking. Keep React Query invalidation/refetch approach (no realtime)."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Add a data-driven Premium badge for salons where isPremium is true, shown in both salon list cards and salon details header/hero.",
      "acceptanceCriteria": [
        "If salon.isPremium is true, a Premium badge is displayed on that salon’s card and in its details header/hero area.",
        "If salon.isPremium is false, the badge is not rendered.",
        "Premium badge rendering works for seeded salons and for newly created salons (as applicable).",
        "All user-facing text related to the badge is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PremiumBadge.tsx",
          "operation": "create",
          "description": "Create a small PremiumBadge component that renders an English “Premium” label with consistent styling and can be conditionally shown based on salon.isPremium. Prefer shadcn-ui components (e.g., Badge) if present. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/SalonListSection.tsx",
          "operation": "modify",
          "description": "Update salon list UI to conditionally render PremiumBadge for each salon where salon.isPremium is true (including any featured/hero salon and list items). Remove any hardcoded premium label logic."
        },
        {
          "path": "frontend/src/pages/SalonDetailsPage.tsx",
          "operation": "modify",
          "description": "Update salon details header/hero area to use salon.photoUrls[0] for the hero image and conditionally render PremiumBadge when salon.isPremium is true. Ensure any newly introduced/modified badge-related text is English."
        }
      ]
    }
  ]
}