{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Overwrite AppV1 with V34 “ETHEREAL FLOW” UI and ensure it compiles",
  "requirements": [
    {
      "id": "REQ-109",
      "summary": "Fully overwrite frontend/src/AppV1.jsx with the provided V34 “ETHEREAL FLOW” UI code (layout, Tailwind styling, local DATA, and Landing→Client→Pro flow).",
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` contents are replaced end-to-end with the provided V34 code (not a partial merge).",
        "The app boots into the V34 flow (landing view visible first, with actions to enter Client or Pro).",
        "The Client view shows the top sticky capsule filters and the bottom floating island navigation as implemented in V34.",
        "Clicking a salon card expands into the full-screen detail overlay with shared `layoutId` transitions, and the booking CTA remains reachable at the bottom as implemented in V34.",
        "The Pro studio view renders the split editor/preview experience on desktop and behaves as provided in V34."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Replace the file contents entirely by pasting the user-provided V34 “ETHEREAL FLOW” code block as-is (preserve its Tailwind classes, local seed data/DATA, and interaction logic for Landing→Client feed→Pro studio)."
        }
      ]
    },
    {
      "id": "REQ-110",
      "summary": "Apply only minimal mechanical fixes required for this repo so the V34 overwrite compiles/runs without altering intended UI/copy/behavior, and keep the existing .hide-scrollbar utility working.",
      "acceptanceCriteria": [
        "`npm run build` (or the repository’s standard build) succeeds without code changes outside minimal mechanical fixes.",
        "No runtime errors occur on initial load (Landing → Client → Pro navigation is usable).",
        "The existing `.hide-scrollbar` utility continues to work for the horizontal capsule scroller (no visible scrollbars in supported browsers)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Make minimal mechanical adjustments needed for this repository to compile and run (e.g., fix/import missing symbols, resolve invalid JSX, remove duplicate exports, ensure required dependencies are imported) while keeping the intended V34 UI, copy, and interactions unchanged."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Verify `.hide-scrollbar` remains present and compatible with the V34 capsule scroller usage; if V34 introduces any required global utility classes that are purely mechanical for rendering (not redesign), add them here without changing the visual intent."
        }
      ]
    },
    {
      "id": "REQ-111",
      "summary": "Prevent stale state closures in the V34 Pro “Deploy” action so newly created salons reliably prepend to the in-memory salons list and switch back to Client immediately.",
      "acceptanceCriteria": [
        "After clicking “Deploy” in Pro studio, the new salon appears immediately at the top of the Client feed without requiring refresh.",
        "Repeated deploys in a single session do not intermittently lose previously deployed salons due to stale state.",
        "The view still switches to Client immediately after deploy, matching V34 behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Update the V34 `handleDeploy` path to use a functional state update (`setSalons(prev => [newSalon, ...prev])`) to avoid stale closures, while preserving identical visible behavior (prepend new salon + immediate switch to Client)."
        }
      ]
    },
    {
      "id": "REQ-112",
      "summary": "Keep App.tsx and immutable frontend entry/hook/ui paths unchanged; ensure V34 continues to mount via existing Vite/React wiring through App.tsx rendering AppV1.",
      "acceptanceCriteria": [
        "`frontend/src/App.tsx` remains a simple wrapper that renders `AppV1` and is unchanged.",
        "No files under the platform’s immutable frontend paths are modified.",
        "The application still mounts and renders through the existing entrypoint setup."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Ensure the overwritten V34 file continues to export the AppV1-compatible default React component expected by `frontend/src/App.tsx` (do not modify App.tsx or any immutable entry/hook/ui files)."
        }
      ]
    }
  ]
}