{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace AppV1 with V51 “NEXUS VIRAL” and ensure build passes",
  "requirements": [
    {
      "id": "REQ-168",
      "summary": "Overwrite AppV1.jsx with the exact user-provided V51 “NEXUS VIRAL (Growth & Conversion)” code (verbatim).",
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` contains exactly the provided V51 code, with no refactors, feature additions, or copy changes.",
        "The V51 implementation includes the four engines as coded: (1) native share via `navigator.share`, (2) WhatsApp deep-link booking, (3) Swiss ZIP↔city search suggestions, and (4) cinematic dark luxury UI styling.",
        "The app continues to mount via `frontend/src/App.tsx` rendering `AppV1` (no entrypoint rewiring)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Delete the entire current contents and paste the exact V51 “NEXUS VIRAL (Growth & Conversion)” code block from the user message (msg-1) as a verbatim overwrite. Do not change formatting, strings, Tailwind classes, or logic."
        }
      ]
    },
    {
      "id": "REQ-169",
      "summary": "Apply minimal mechanical fixes required for this repo so the V51 overwrite compiles and runs without altering V51 design/copy/behavior.",
      "acceptanceCriteria": [
        "`npm`/Vite build succeeds with the new `AppV1.jsx` in place.",
        "No runtime crash occurs on initial load; the Landing screen renders and navigation to Client and Pro views works.",
        "Any fixes made are strictly mechanical (e.g., import corrections) and do not alter visual design, strings, or flow logic in the provided V51 code."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "If the verbatim V51 paste is build-blocking in this repository, make only strictly mechanical adjustments inside this file (e.g., fix missing/incorrect imports, resolve undefined identifiers, correct invalid JSX/React syntax, ensure a valid default export for AppV1). Do not add features, do not change any UI/copy, do not add backend calls, and do not rewire the entrypoint (App.tsx must remain unchanged)."
        }
      ]
    }
  ]
}