{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Overwrite AppV1 with V65 Nexus Professional booking flow (Date/Time + Identity)",
  "requirements": [
    {
      "id": "REQ-204",
      "summary": "Fully overwrite AppV1.jsx with the exact user-provided V65 “NEXUS PROFESSIONAL” code block, verbatim.",
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` content matches the provided V65 code block exactly (full overwrite, no partial merge).",
        "The app still boots through the existing `frontend/src/App.tsx` wrapper (no entry wiring changes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Delete the current file contents and replace the entire file with the exact V65 “NEXUS PROFESSIONAL” code block provided by the user (verbatim), preserving imports, local constants/datasets, Tailwind classes, UI strings, and interaction logic."
        }
      ]
    },
    {
      "id": "REQ-205",
      "summary": "Apply only minimal mechanical compile/run fixes required by the repo after the V65 overwrite, without changing intended UI/behavior.",
      "acceptanceCriteria": [
        "`npm run build` and `npm run dev` succeed without runtime errors.",
        "Any changes beyond the verbatim V65 overwrite are limited strictly to build-breaking mechanical fixes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "If the verbatim V65 code does not compile in this repository, apply strictly mechanical fixes only (e.g., missing/incorrect imports, undefined identifiers, invalid JSX/TSX issues, duplicate exports) while preserving all intended V65 UI, styling, copy, datasets, and interaction behavior. Keep all behavior local-only (no backend calls)."
        }
      ]
    },
    {
      "id": "REQ-206",
      "summary": "Preserve/verify the V65 sequential local-only booking flow and gating of Mirror Protocol until after the booked ticket step.",
      "acceptanceCriteria": [
        "After selecting at least one service, the next step is a Date/Time screen where a day and a time slot can be selected.",
        "The user cannot proceed from Date/Time to the next step unless a time slot is selected.",
        "After Date/Time, an Identity screen collects client name and phone; the user cannot submit the request unless both fields are non-empty.",
        "Submitting the request shows a Pending screen and automatically transitions to Booked after ~3 seconds.",
        "The “Pay & Reveal” / Mirror Protocol entry point is only available on the Booked ticket screen (not during selection, datetime, identity, or pending)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Ensure the V65 in-file state machine implements the required step order (Selection → Date/Time → Identity → Request → Pending (~3s) → Booked → Mirror Protocol) and enforces gating/validation so users cannot skip required selections and cannot access Mirror Protocol before the Booked ticket screen; keep logic entirely local-only."
        }
      ]
    },
    {
      "id": "REQ-207",
      "summary": "Ensure the booked ticket displays the selected date/time and client identity captured earlier in the V65 flow.",
      "acceptanceCriteria": [
        "The booked ticket UI shows the selected day label and selected time slot.",
        "The booked ticket UI shows the entered client name alongside the selected date/time (per the V65 UI)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Verify the booked ticket view renders the user-selected day label/time slot from the Date/Time step and the collected client identity (name, and any other identity fields present in V65) from the Identity step, using the exact V65 display logic and strings."
        }
      ]
    }
  ]
}