{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "V43 NEXUS SECURE CONNECT: AppV1 replacement + compile fixes + domicile logistics gating + secure chat + privacy UI",
  "requirements": [
    {
      "id": "REQ-139",
      "summary": "Replace AppV1 with the exact user-provided V43 “NEXUS SECURE CONNECT” code (full-file overwrite only).",
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` contents match the provided V43 code (full-file overwrite; no partial merges).",
        "No changes are made to `frontend/src/App.tsx`; it remains a thin wrapper that renders `AppV1`.",
        "The app boots and renders the V43 UI (Landing → Client → Pro) using local in-file data only (no backend calls introduced)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Fully overwrite the entire file with the exact V43 “NEXUS SECURE CONNECT” code block provided by the user, verbatim (no merges, no edits)."
        }
      ]
    },
    {
      "id": "REQ-140",
      "summary": "Make the V43 UI compile in this repo with only minimal mechanical fixes (imports/undefined identifiers/JSX validity) while preserving V43 layout, Tailwind classes, copy, and behavior.",
      "acceptanceCriteria": [
        "`npm run build` (or equivalent) succeeds with no unresolved symbols referenced from `frontend/src/AppV1.jsx` (e.g., Framer Motion, lucide-react icons, React hooks).",
        "No immutable frontend entry files are modified (especially files under `frontend/src/hooks/*` listed as immutable and `frontend/src/main.tsx`)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MotionButton.tsx",
          "operation": "modify",
          "description": "Implement a minimal, build-safe MotionButton component (non-animated fallback if needed) matching any V43 imports/usage to eliminate unresolved references, without changing V43 UI copy or layout."
        },
        {
          "path": "frontend/src/components/Pressable.tsx",
          "operation": "modify",
          "description": "Implement a minimal Pressable wrapper component (e.g., forwards props/refs, supports className/onClick) compatible with any V43 usage to fix build errors without altering intended behavior."
        },
        {
          "path": "frontend/src/components/PremiumBadge.tsx",
          "operation": "modify",
          "description": "Implement a minimal PremiumBadge component (presentational only) if referenced by V43, ensuring exports align with how V43 imports it."
        },
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Implement a minimal ProfileSetupModal component (can be a no-op render when closed) only to satisfy any V43 references; do not introduce authentication flows beyond what V43 already contains."
        },
        {
          "path": "frontend/src/components/AuthHeader.tsx",
          "operation": "modify",
          "description": "Implement a minimal AuthHeader component if referenced by V43 (pure UI/header shell), avoiding new authentication requirements unless V43 already includes them."
        },
        {
          "path": "frontend/src/components/SalonListSection.tsx",
          "operation": "modify",
          "description": "Implement a minimal SalonListSection component if referenced by V43 (presentation + props passthrough) to resolve any missing imports."
        },
        {
          "path": "frontend/src/components/VipDashboard.tsx",
          "operation": "modify",
          "description": "Implement a minimal VipDashboard component if referenced by V43 to prevent unresolved module/component errors during build."
        },
        {
          "path": "frontend/src/components/MemberCard.tsx",
          "operation": "modify",
          "description": "Implement a minimal MemberCard component if referenced by V43 to satisfy compilation (UI-only, local state only)."
        },
        {
          "path": "frontend/src/components/MonopolyModeSwitch.tsx",
          "operation": "modify",
          "description": "Implement a minimal MonopolyModeSwitch toggle component if referenced by V43; keep it frontend-only and do not add backend calls."
        },
        {
          "path": "frontend/src/components/RevenueChart.tsx",
          "operation": "modify",
          "description": "Implement a minimal RevenueChart component stub if referenced by V43 (static chart placeholder) to fix build-time missing exports."
        },
        {
          "path": "frontend/src/components/CreateSalonForm.tsx",
          "operation": "modify",
          "description": "Implement a minimal CreateSalonForm component stub if referenced by V43, keeping all behavior local-only and avoiding backend integration."
        },
        {
          "path": "frontend/src/components/ProSalonWizard.tsx",
          "operation": "modify",
          "description": "Implement a minimal ProSalonWizard component stub if referenced by V43 to satisfy imports, preserving any V43 navigation expectations."
        },
        {
          "path": "frontend/src/components/ProStudioCreator.tsx",
          "operation": "modify",
          "description": "Implement a minimal ProStudioCreator component stub if referenced by V43 to satisfy compilation; keep local-only."
        }
      ]
    },
    {
      "id": "REQ-141",
      "summary": "Ensure V43 booking-request flow enforces domicile logistics completion, shows pending confirmation with a “Chat with the Pro” action opening an in-app secure chat UI, and displays privacy reassurance messaging.",
      "acceptanceCriteria": [
        "For a salon with `type === \"Domicile\"`, attempting to proceed from service selection to sending a request requires the logistics form step to be completed first (address and access info must be non-empty).",
        "After a request is sent, the UI shows a pending/awaiting-confirmation screen and displays an action to open the secure chat interface.",
        "The secure chat UI supports sending messages in local state and can be closed to return to the pending screen.",
        "A privacy reassurance message is visible in the logistics step and/or pending flow, consistent with the V43 design."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Within the V43 AppV1 implementation (as provided by the user), verify the domicile logistics gating (address + access instructions required before sending), pending confirmation screen, “Chat with the Pro” CTA that opens/closes an in-app secure chat UI using local state only, and visible privacy reassurance messaging. If any of these are missing in the provided V43 block, apply the smallest possible mechanical edits inside AppV1 to implement them without changing intended V43 layout, Tailwind classes, copy, or interaction behavior, and without adding backend calls."
        }
      ]
    }
  ]
}