{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "V38 Genesis Architect (AppV1.jsx full overwrite + build fixes + robust deploy state update)",
  "requirements": [
    {
      "id": "REQ-119",
      "summary": "Fully overwrite AppV1.jsx with the user-provided V38 “GENESIS ARCHITECT” single-file app UI (Landing → Client → Pro Studio) including Smart Presets, detailed service studio fields, and desktop split-view live preview.",
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` is a full overwrite with the provided V38 code (no partial merges).",
        "The application boots into the V38 landing screen and can navigate to Client and Pro views using only in-file local state (no backend calls).",
        "Smart Presets are present in the Pro studio: selecting/using a category shows preset service chips that add a service in one click.",
        "Detailed Service Studio is present: each service supports per-service image, technical description, duration, and price in the Pro studio and is rendered in the client service menu.",
        "Split-view is present on desktop widths: left side tools, right side live client preview panel."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Replace the entire file contents with the exact V38 “GENESIS ARCHITECT” code block provided by the user (full overwrite, no merging). Preserve all provided imports, local data (e.g., `INITIAL_SALONS`, `PRESETS`), Tailwind classes, French UI strings, and in-file state-driven navigation/interaction logic so the app remains frontend-only/local-state."
        }
      ]
    },
    {
      "id": "REQ-120",
      "summary": "Apply only minimal mechanical adjustments needed for the V38 AppV1.jsx to compile and run in this repo without changing intended UI/UX behavior.",
      "acceptanceCriteria": [
        "`npm test`/build (or the platform build) succeeds for the frontend without modifying immutable entry files.",
        "No runtime crash on initial render (landing view).",
        "Any fixes are limited to build-breakers (e.g., adding a missing import for a referenced symbol) and do not alter the provided UI/UX behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "After pasting the V38 code, make only build-blocking mechanical fixes required by this codebase (e.g., adjust/restore missing imports for referenced symbols, fix invalid JSX, remove duplicate default exports, resolve undefined identifiers) while keeping the intended V38 layout/styling/copy/behavior unchanged. Do not add backend calls or auth flows."
        }
      ]
    },
    {
      "id": "REQ-121",
      "summary": "Harden the V38 Pro deploy/publish flow against stale React state closures by using a functional salons state update in handleDeploy while keeping identical visible behavior.",
      "acceptanceCriteria": [
        "After deploying a new salon from the Pro studio, the new salon appears at the top of the client list immediately.",
        "Rapid successive deploy attempts do not lose the newly added salon due to stale state closures.",
        "The view still switches to Client immediately after a successful deploy, matching the provided behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "In the V38 `handleDeploy` path, change salons insertion to a functional update (e.g., `setSalons(prev => [newSalon, ...prev])`) to prevent stale-closure issues, while preserving identical visible behavior (new salon immediately at top; view switches to Client)."
        }
      ]
    }
  ]
}