{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "V14 “DIVINE OS” local-demo reset (AppV1.jsx verbatim overwrite)",
  "requirements": [
    {
      "id": "REQ-65",
      "summary": "Fully overwrite frontend/src/AppV1.jsx with the provided V14 “DIVINE OS” code block verbatim (local React state only).",
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` content matches the provided V14 code block exactly (full file overwrite; no partial merges).",
        "No backend calls are introduced by the new `AppV1` implementation; all behavior is driven by local React state only.",
        "The app renders the Landing screen first and allows switching to Client (\"Explorer\") and Pro (\"Créer\") flows per the injected code."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Replace the entire file contents with the user-provided V14 “DIVINE OS” code block exactly as given (verbatim), ensuring it remains a 100% local demo (no actor/hooks/backend imports or calls)."
        }
      ]
    },
    {
      "id": "REQ-66",
      "summary": "Ensure the app still compiles/runs with App.tsx remaining a thin wrapper that renders AppV1, and preserve the injected UI behaviors across Client/Pro flows.",
      "acceptanceCriteria": [
        "`frontend/src/App.tsx` remains a thin wrapper rendering `AppV1` (no entry wiring changes).",
        "Production build/dev server succeeds without runtime errors on initial load.",
        "In the Client view: (a) toggling a heart updates Favorites state and Favorites tab renders the favorite salons; (b) clicking the trash icon removes a salon card from the feed; (c) clicking a service adds a booking entry and navigates to the Agenda tab; (d) completing ProWizard and clicking “DÉPLOYER” injects the new salon into the Client feed and it appears in the Stories rail list during the same session."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Keep App.tsx as the thin wrapper that only renders <AppV1 />; make no functional entry/wiring changes beyond what is required to compile."
        },
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "After the verbatim overwrite, validate the injected V14 UI compiles under the existing Vite/React/Tailwind setup and that all required in-session behaviors (favorites, delete from feed, booking->agenda navigation, Pro deploy injecting salon into feed/stories) work without introducing backend calls; if any compile-only fixes are necessary, they must be reconciled with the requirement that the file match the provided code verbatim."
        }
      ]
    }
  ]
}