{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "V24 OMEGA SINGULARITY UI overwrite for AppV1",
  "requirements": [
    {
      "id": "REQ-86",
      "summary": "Fully overwrite AppV1.jsx with the user-provided V24 “OMEGA SINGULARITY” UI (morphing cards + orbital CoreNav + category slider) as the complete local-state app.",
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` is a full overwrite containing the V24 code as provided (no refactors or feature additions).",
        "The app still boots via the existing `frontend/src/App.tsx` wrapper rendering `AppV1` (no entry wiring changes).",
        "In the Client Home tab, clicking a salon compact card morphs into the full-screen expanded view using Framer Motion shared `layoutId` (no route/page navigation).",
        "The bottom orbital CoreNav is the primary navigation (Home/Agenda/Favorites) and expands/collapses into a circular menu from a central orb button.",
        "The top category slider controls filtering immediately and the UI remains predominantly pure black with high-contrast white typography per the provided styling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Replace the entire file contents with the exact V24 “OMEGA SINGULARITY” code provided by the user, preserving its components, local DATA, Tailwind classes, imports, and interaction logic (Framer Motion layoutId morphing, orbital CoreNav, category slider filtering, Vantablack aesthetic)."
        }
      ]
    },
    {
      "id": "REQ-87",
      "summary": "Apply only minimal mechanical fixes needed for this repo so the V24 AppV1.jsx compiles and runs without altering intended UI/animations/flows.",
      "acceptanceCriteria": [
        "`npm`/Vite build succeeds with no unresolved symbol/import errors originating from `frontend/src/AppV1.jsx`.",
        "No changes are made to any frontend immutable entry files (including `frontend/src/main.tsx` and Internet Identity hooks).",
        "Only mechanical build-breaking issues are fixed; the visible UI/animations/flows remain consistent with the provided V24 implementation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "After the V24 paste, make only mechanical, build-blocking fixes required by this repository (e.g., correct missing/incorrect imports, remove unused imports if they break lint/build, fix invalid JSX/TSX interop issues, resolve duplicate exports) while keeping the V24 UI design, copy, and interaction behavior unchanged."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If (and only if) the V24 code references custom utility class names/keyframes not currently defined (e.g., scrollbar hiding or specific animation names), add minimal compatible CSS utilities/keyframes here to restore intended visuals without changing the V24 component structure or behavior."
        }
      ]
    }
  ]
}