{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "V37 NEXUS PRO MAX overwrite of AppV1 (frontend-only local-state demo)",
  "requirements": [
    {
      "id": "REQ-117",
      "summary": "Overwrite frontend/src/AppV1.jsx with the user-provided V37 “NEXUS PRO MAX” code block as the complete UI and interaction flow (Landing → Client → Pro Studio), preserving seed data, Tailwind classes, imports, strings, and logic.",
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` is a full overwrite of the user-provided V37 code block (no partial merges).",
        "The app boots via the existing `frontend/src/App.tsx` wrapper and shows the V37 Landing screen.",
        "The V37 Client flow works: selecting a salon opens details; selecting multiple services updates the sticky cart totals (price and duration) in real time; clicking the cart CTA closes the detail view as in the provided code.",
        "The V37 Pro flow works: opening “Pro” shows the TitanStudio with Identity/Services/Availability tabs; adding services supports photo, technical description, duration, and price; publishing injects the new salon into the client list as in the provided code.",
        "The Schedule/Availability selections in Pro (e.g., Nocturne/Dimanche/Lundi tags) appear as availability/tag badges on the salon card in the client list, consistent with the provided code."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Replace the entire file contents with the exact V37 “NEXUS PRO MAX” code block provided by the user (full paste, no merging). Keep all V37 components, local seed data (INITIAL_SALONS), Tailwind classes, imports, French UI strings, and interaction logic exactly as provided, so the existing frontend/src/App.tsx wrapper continues to render AppV1 and the first view is the V37 Landing screen."
        }
      ]
    },
    {
      "id": "REQ-118",
      "summary": "Apply minimal mechanical compile/run fixes for the V37 paste (without changing intended UI/copy/behavior) and make Pro Publish injection robust via functional setSalons update to avoid stale state closures.",
      "acceptanceCriteria": [
        "`npm run build` (or the project’s equivalent build) succeeds without runtime errors caused by missing imports or undefined identifiers introduced by the V37 paste.",
        "No refactors/feature additions are introduced beyond what is necessary to make the pasted V37 code compile and run in this repo.",
        "Publishing a salon from the Pro studio always injects the new salon at the top of the client list, even after rapid successive publishes/navigation, with the same visible behavior (new salon on top and view switches to Client)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "After the V37 overwrite, make only repository-compatibility fixes required to compile (e.g., adjust React/lucide imports, resolve undefined symbols, fix invalid JSX, remove duplicate exports) while preserving V37 design, copy, and interaction behavior. Update the Pro “Publish/Deploy” salon injection to use a functional state update `setSalons(prev => [newSalon, ...prev])` to prevent stale closure issues, keeping identical visible behavior (new salon appears first and app navigates back to Client)."
        }
      ]
    }
  ]
}