{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Overwrite AppV1 with V45 “NEXUS ELITE POLISH” and keep the frontend building",
  "requirements": [
    {
      "id": "REQ-147",
      "summary": "Fully replace frontend/src/AppV1.jsx with the exact V45 “NEXUS ELITE POLISH” code provided by the user, preserving all provided UI, seed data, imports, strings, and logic.",
      "acceptanceCriteria": [
        "`frontend/src/AppV1.jsx` contents exactly match the V45 code provided by the user (no partial merges).",
        "`frontend/src/App.tsx` continues to render `AppV1` as the app root (wrapper remains unchanged).",
        "No backend calls are introduced; the app remains a local-state demo driven by the in-file data structures."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "Overwrite the entire file with the exact V45 “NEXUS ELITE POLISH” code block from the referenced user message (full file replacement; no partial merges). Ensure the in-file local seed data (INITIAL_SALONS, PRESETS), Tailwind classes, imports, UI strings, and interaction logic remain exactly as provided, and that no backend integration is added."
        }
      ]
    },
    {
      "id": "REQ-148",
      "summary": "Apply only minimal mechanical fixes needed for this repo so the V45 AppV1 build succeeds without altering intended UI/layout/styling/copy/behavior.",
      "acceptanceCriteria": [
        "`npm run build` (or equivalent CI build) succeeds with the V45 `AppV1.jsx` code in place.",
        "The app loads in the browser without runtime errors (blank screen, red error overlay, or console exceptions).",
        "Any changes made beyond the overwrite are limited to build-breaking mechanical fixes only (no refactors, no feature additions)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/AppV1.jsx",
          "operation": "modify",
          "description": "If (and only if) the V45 drop-in produces build/runtime errors in this repository, apply minimal mechanical fixes within this file (e.g., missing/incorrect imports, unresolved identifiers, invalid JSX, duplicate exports) while keeping the intended V45 UI layout, styling (Tailwind classes), copy, and interaction behavior unchanged. Do not introduce backend calls."
        }
      ]
    },
    {
      "id": "REQ-149",
      "summary": "Preserve and verify the V45 visual changes (mobile selector grid, premium glass/gradient textures, and revamped Pro landing hero/background image + typography).",
      "acceptanceCriteria": [
        "On mobile viewport widths (~360–430px), the Salon/Domicile selector renders as a 2-column grid with equal-width buttons and no horizontal overflow/clipping.",
        "Cards/surfaces show the intended gradient + glass/blur treatments as defined by the provided Tailwind classes (no regression to flat solid cards).",
        "Entering the Pro experience shows the revamped Pro landing/welcome state with the large background image and larger marketing typography as in V45."
      ],
      "file_operations": [
        {
          "path": "frontend/src/v45-visual-checklist.md",
          "operation": "create",
          "description": "Add a short internal verification checklist (in English) describing how to manually confirm: (1) the Salon/Domicile selector uses a 2-column grid with no overflow at ~360–430px widths, (2) cards/surfaces show the intended gradient + glassmorphism Tailwind treatments, and (3) the Pro landing/welcome state shows the large background image and larger marketing typography as in V45. This file is for verification only and must not change app behavior."
        }
      ]
    }
  ]
}